
./build/debug-linux-x86_64_-_obj/ded/sv_main.o:     file format elf64-x86-64


Disassembly of section .text:

0000000000000000 <SV_ExpandNewlines>:
SV_ExpandNewlines():
/media/WD3tbUSB3_00/CODE/cpp/__S/workspace/Quake3e/code/server/sv_main.c:81
SV_ExpandNewlines

Converts newlines to "\n" so a line prints nicer
===============
*/
static const char *SV_ExpandNewlines( const char *in ) {
       0:	55                   	push   rbp
       1:	48 89 e5             	mov    rbp,rsp
       4:	48 89 7d e8          	mov    QWORD PTR [rbp-0x18],rdi
/media/WD3tbUSB3_00/CODE/cpp/__S/workspace/Quake3e/code/server/sv_main.c:85
	static char string[MAX_STRING_CHARS*2];
	int		l;

	l = 0;
       8:	c7 45 fc 00 00 00 00 	mov    DWORD PTR [rbp-0x4],0x0
/media/WD3tbUSB3_00/CODE/cpp/__S/workspace/Quake3e/code/server/sv_main.c:86
	while ( *in && l < sizeof(string) - 3 ) {
       f:	eb 5a                	jmp    6b <SV_ExpandNewlines+0x6b>
/media/WD3tbUSB3_00/CODE/cpp/__S/workspace/Quake3e/code/server/sv_main.c:87
		if ( *in == '\n' ) {
      11:	48 8b 45 e8          	mov    rax,QWORD PTR [rbp-0x18]
      15:	0f b6 00             	movzx  eax,BYTE PTR [rax]
      18:	3c 0a                	cmp    al,0xa
      1a:	75 2e                	jne    4a <SV_ExpandNewlines+0x4a>
/media/WD3tbUSB3_00/CODE/cpp/__S/workspace/Quake3e/code/server/sv_main.c:88
			string[l++] = '\\';
      1c:	8b 45 fc             	mov    eax,DWORD PTR [rbp-0x4]
      1f:	8d 50 01             	lea    edx,[rax+0x1]

    <19>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_high_pc     : 0x27e3
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 1
    <2f>   DW_AT_encoding    : 8	(unsigned char)
    <30>   DW_AT_name        : (indirect string, offset: 0x74c): unsigned char
 <1><34>: Abbrev Number: 2 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 2
    <36>   DW_AT_encoding    : 7	(unsigned)
    <37>   DW_AT_name        : (indirect string, offset: 0x10be): short unsigned int
 <1><3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 4
    <3d>   DW_AT_encoding    : 7	(unsigned)
    <3e>   DW_AT_name        : (indirect string, offset: 0x1e0e): unsigned int
 <1><42>: Abbrev Number: 2 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 8
    <44>   DW_AT_encoding    : 7	(unsigned)
    <45>   DW_AT_name        : (indirect string, offset: 0x14fd): long unsigned int
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1
    <4b>   DW_AT_encoding    : 6	(signed char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x10ed): signed char
 <1><50>: Abbrev Number: 2 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0x1e81): short int
 <1><57>: Abbrev Number: 3 (DW_TAG_typedef)
    <58>   DW_AT_name        : (indirect string, offset: 0x5ee): __uint16_t
    <5c>   DW_AT_decl_file   : 2
    <5d>   DW_AT_decl_line   : 39
    <5e>   DW_AT_decl_column : 28
    <5f>   DW_AT_type        : <0x34>
 <1><63>: Abbrev Number: 3 (DW_TAG_typedef)
    <64>   DW_AT_name        : (indirect string, offset: 0x18d5): __int32_t
    <68>   DW_AT_decl_file   : 2
    <69>   DW_AT_decl_line   : 40
    <6a>   DW_AT_decl_column : 20
    <6b>   DW_AT_type        : <0x6f>
 <1><6f>: Abbrev Number: 4 (DW_TAG_base_type)
    <70>   DW_AT_byte_size   : 4
    <71>   DW_AT_encoding    : 5	(signed)
    <72>   DW_AT_name        : int
 <1><76>: Abbrev Number: 5 (DW_TAG_const_type)
    <77>   DW_AT_type        : <0x6f>
 <1><7b>: Abbrev Number: 3 (DW_TAG_typedef)
    <7c>   DW_AT_name        : (indirect string, offset: 0x18e7): __uint32_t
    <80>   DW_AT_decl_file   : 2
    <81>   DW_AT_decl_line   : 41
    <82>   DW_AT_decl_column : 22
    <83>   DW_AT_type        : <0x3b>
 <1><87>: Abbrev Number: 2 (DW_TAG_base_type)
    <88>   DW_AT_byte_size   : 8
    <89>   DW_AT_encoding    : 5	(signed)
    <8a>   DW_AT_name        : (indirect string, offset: 0x130f): long int
 <1><8e>: Abbrev Number: 3 (DW_TAG_typedef)
    <8f>   DW_AT_name        : (indirect string, offset: 0x243): __off_t
    <93>   DW_AT_decl_file   : 2
    <94>   DW_AT_decl_line   : 150
    <95>   DW_AT_decl_column : 25
    <96>   DW_AT_type        : <0x87>
 <1><9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x1197): __off64_t
    <9f>   DW_AT_decl_file   : 2
    <a0>   DW_AT_decl_line   : 151
    <a1>   DW_AT_decl_column : 27
    <a2>   DW_AT_type        : <0x87>
 <1><a6>: Abbrev Number: 6 (DW_TAG_array_type)
    <a7>   DW_AT_type        : <0x6f>
    <ab>   DW_AT_sibling     : <0xb6>
 <2><af>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <b0>   DW_AT_type        : <0x42>
    <b4>   DW_AT_upper_bound : 1
 <2><b5>: Abbrev Number: 0
 <1><b6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b7>   DW_AT_byte_size   : 8
 <1><b8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b9>   DW_AT_byte_size   : 8
    <ba>   DW_AT_type        : <0xbe>
 <1><be>: Abbrev Number: 2 (DW_TAG_base_type)
    <bf>   DW_AT_byte_size   : 1
    <c0>   DW_AT_encoding    : 6	(signed char)
    <c1>   DW_AT_name        : (indirect string, offset: 0x1562): char
 <1><c5>: Abbrev Number: 5 (DW_TAG_const_type)
    <c6>   DW_AT_type        : <0xbe>
 <1><ca>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb>   DW_AT_byte_size   : 4
    <cc>   DW_AT_encoding    : 4	(float)
    <cd>   DW_AT_name        : (indirect string, offset: 0x78d): float
 <1><d1>: Abbrev Number: 2 (DW_TAG_base_type)
    <d2>   DW_AT_byte_size   : 8
    <d3>   DW_AT_encoding    : 4	(float)
    <d4>   DW_AT_name        : (indirect string, offset: 0x181e): double
 <1><d8>: Abbrev Number: 10 (DW_TAG_variable)
    <d9>   DW_AT_name        : (indirect string, offset: 0xcb6): signgam
    <dd>   DW_AT_decl_file   : 9
    <de>   DW_AT_decl_line   : 773
    <e0>   DW_AT_decl_column : 12
    <e1>   DW_AT_type        : <0x6f>
    <e5>   DW_AT_external    : 1
    <e5>   DW_AT_declaration : 1
 <1><e5>: Abbrev Number: 3 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0xa00): size_t
    <ea>   DW_AT_decl_file   : 3
    <eb>   DW_AT_decl_line   : 216
    <ec>   DW_AT_decl_column : 23
    <ed>   DW_AT_type        : <0x42>
 <1><f1>: Abbrev Number: 3 (DW_TAG_typedef)
    <f2>   DW_AT_name        : (indirect string, offset: 0x6b6): __gnuc_va_list
    <f6>   DW_AT_decl_file   : 4
    <f7>   DW_AT_decl_line   : 40
    <f8>   DW_AT_decl_column : 27
    <f9>   DW_AT_type        : <0xfd>
 <1><fd>: Abbrev Number: 11 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (indirect string, offset: 0x388): __builtin_va_list
    <102>   DW_AT_type        : <0x106>
 <1><106>: Abbrev Number: 6 (DW_TAG_array_type)
    <107>   DW_AT_type        : <0x116>
    <10b>   DW_AT_sibling     : <0x116>
 <2><10f>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <110>   DW_AT_type        : <0x42>
    <114>   DW_AT_upper_bound : 0
 <2><115>: Abbrev Number: 0
 <1><116>: Abbrev Number: 12 (DW_TAG_structure_type)
    <117>   DW_AT_name        : (indirect string, offset: 0x48f): __va_list_tag
    <11b>   DW_AT_byte_size   : 24
    <11c>   DW_AT_decl_file   : 5
    <11d>   DW_AT_decl_line   : 0
    <11e>   DW_AT_sibling     : <0x153>
 <2><122>: Abbrev Number: 13 (DW_TAG_member)
    <123>   DW_AT_name        : (indirect string, offset: 0x1014): gp_offset
    <127>   DW_AT_decl_file   : 5
    <128>   DW_AT_decl_line   : 0
    <129>   DW_AT_type        : <0x3b>
    <12d>   DW_AT_data_member_location: 0
 <2><12e>: Abbrev Number: 13 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0xfeb): fp_offset
    <133>   DW_AT_decl_file   : 5
    <134>   DW_AT_decl_line   : 0
    <135>   DW_AT_type        : <0x3b>
    <139>   DW_AT_data_member_location: 4
 <2><13a>: Abbrev Number: 13 (DW_TAG_member)
    <13b>   DW_AT_name        : (indirect string, offset: 0x1e7): overflow_arg_area
    <13f>   DW_AT_decl_file   : 5
    <140>   DW_AT_decl_line   : 0
    <141>   DW_AT_type        : <0xb6>
    <145>   DW_AT_data_member_location: 8
 <2><146>: Abbrev Number: 13 (DW_TAG_member)
    <147>   DW_AT_name        : (indirect string, offset: 0x235): reg_save_area
    <14b>   DW_AT_decl_file   : 5
    <14c>   DW_AT_decl_line   : 0
    <14d>   DW_AT_type        : <0xb6>
    <151>   DW_AT_data_member_location: 16
 <2><152>: Abbrev Number: 0
 <1><153>: Abbrev Number: 14 (DW_TAG_structure_type)
    <154>   DW_AT_name        : (indirect string, offset: 0x164b): _IO_FILE
    <158>   DW_AT_byte_size   : 216
    <159>   DW_AT_decl_file   : 6
    <15a>   DW_AT_decl_line   : 49
    <15b>   DW_AT_decl_column : 8
    <15c>   DW_AT_sibling     : <0x2da>
 <2><160>: Abbrev Number: 15 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x207): _flags
    <165>   DW_AT_decl_file   : 6
    <166>   DW_AT_decl_line   : 51
    <167>   DW_AT_decl_column : 7
    <168>   DW_AT_type        : <0x6f>
    <16c>   DW_AT_data_member_location: 0
 <2><16d>: Abbrev Number: 15 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0x1b36): _IO_read_ptr
    <172>   DW_AT_decl_file   : 6
    <173>   DW_AT_decl_line   : 54
    <174>   DW_AT_decl_column : 9
    <175>   DW_AT_type        : <0xb8>
    <179>   DW_AT_data_member_location: 8
 <2><17a>: Abbrev Number: 15 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x160c): _IO_read_end
    <17f>   DW_AT_decl_file   : 6
    <180>   DW_AT_decl_line   : 55
    <181>   DW_AT_decl_column : 9
    <182>   DW_AT_type        : <0xb8>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 15 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0x11a8): _IO_read_base
    <18c>   DW_AT_decl_file   : 6
    <18d>   DW_AT_decl_line   : 56
    <18e>   DW_AT_decl_column : 9
    <18f>   DW_AT_type        : <0xb8>
    <193>   DW_AT_data_member_location: 24
 <2><194>: Abbrev Number: 15 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x1229): _IO_write_base
    <199>   DW_AT_decl_file   : 6
    <19a>   DW_AT_decl_line   : 57
    <19b>   DW_AT_decl_column : 9
    <19c>   DW_AT_type        : <0xb8>
    <1a0>   DW_AT_data_member_location: 32
 <2><1a1>: Abbrev Number: 15 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x8c3): _IO_write_ptr
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 58
    <1a8>   DW_AT_decl_column : 9
    <1a9>   DW_AT_type        : <0xb8>
    <1ad>   DW_AT_data_member_location: 40
 <2><1ae>: Abbrev Number: 15 (DW_TAG_member)
    <1af>   DW_AT_name        : (indirect string, offset: 0x460): _IO_write_end
    <1b3>   DW_AT_decl_file   : 6
    <1b4>   DW_AT_decl_line   : 59
    <1b5>   DW_AT_decl_column : 9
    <1b6>   DW_AT_type        : <0xb8>
    <1ba>   DW_AT_data_member_location: 48
 <2><1bb>: Abbrev Number: 15 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x15bd): _IO_buf_base
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 60
    <1c2>   DW_AT_decl_column : 9
    <1c3>   DW_AT_type        : <0xb8>
    <1c7>   DW_AT_data_member_location: 56
 <2><1c8>: Abbrev Number: 15 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x11d8): _IO_buf_end
    <1cd>   DW_AT_decl_file   : 6
    <1ce>   DW_AT_decl_line   : 61
    <1cf>   DW_AT_decl_column : 9
    <1d0>   DW_AT_type        : <0xb8>
    <1d4>   DW_AT_data_member_location: 64
 <2><1d5>: Abbrev Number: 15 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0xb2b): _IO_save_base
    <1da>   DW_AT_decl_file   : 6
    <1db>   DW_AT_decl_line   : 64
    <1dc>   DW_AT_decl_column : 9
    <1dd>   DW_AT_type        : <0xb8>
    <1e1>   DW_AT_data_member_location: 72
 <2><1e2>: Abbrev Number: 15 (DW_TAG_member)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x1b12): _IO_backup_base
    <1e7>   DW_AT_decl_file   : 6
    <1e8>   DW_AT_decl_line   : 65
    <1e9>   DW_AT_decl_column : 9
    <1ea>   DW_AT_type        : <0xb8>
    <1ee>   DW_AT_data_member_location: 80
 <2><1ef>: Abbrev Number: 15 (DW_TAG_member)
    <1f0>   DW_AT_name        : (indirect string, offset: 0xf74): _IO_save_end
    <1f4>   DW_AT_decl_file   : 6
    <1f5>   DW_AT_decl_line   : 66
    <1f6>   DW_AT_decl_column : 9
    <1f7>   DW_AT_type        : <0xb8>
    <1fb>   DW_AT_data_member_location: 88
 <2><1fc>: Abbrev Number: 15 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x17b8): _markers
    <201>   DW_AT_decl_file   : 6
    <202>   DW_AT_decl_line   : 68
    <203>   DW_AT_decl_column : 22
    <204>   DW_AT_type        : <0x2f3>
    <208>   DW_AT_data_member_location: 96
 <2><209>: Abbrev Number: 15 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x6e7): _chain
    <20e>   DW_AT_decl_file   : 6
    <20f>   DW_AT_decl_line   : 70
    <210>   DW_AT_decl_column : 20
    <211>   DW_AT_type        : <0x2f9>
    <215>   DW_AT_data_member_location: 104
 <2><216>: Abbrev Number: 15 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0x33): _fileno
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 72
    <21d>   DW_AT_decl_column : 7
    <21e>   DW_AT_type        : <0x6f>
    <222>   DW_AT_data_member_location: 112
 <2><223>: Abbrev Number: 15 (DW_TAG_member)
    <224>   DW_AT_name        : (indirect string, offset: 0x1c6b): _flags2
    <228>   DW_AT_decl_file   : 6
    <229>   DW_AT_decl_line   : 73
    <22a>   DW_AT_decl_column : 7
    <22b>   DW_AT_type        : <0x6f>
    <22f>   DW_AT_data_member_location: 116
 <2><230>: Abbrev Number: 15 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x1c0d): _old_offset
    <235>   DW_AT_decl_file   : 6
    <236>   DW_AT_decl_line   : 74
    <237>   DW_AT_decl_column : 11
    <238>   DW_AT_type        : <0x8e>
    <23c>   DW_AT_data_member_location: 120
 <2><23d>: Abbrev Number: 15 (DW_TAG_member)
    <23e>   DW_AT_name        : (indirect string, offset: 0x1a6b): _cur_column
    <242>   DW_AT_decl_file   : 6
    <243>   DW_AT_decl_line   : 77
    <244>   DW_AT_decl_column : 18
    <245>   DW_AT_type        : <0x34>
    <249>   DW_AT_data_member_location: 128
 <2><24a>: Abbrev Number: 15 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x1eb6): _vtable_offset
    <24f>   DW_AT_decl_file   : 6
    <250>   DW_AT_decl_line   : 78
    <251>   DW_AT_decl_column : 15
    <252>   DW_AT_type        : <0x49>
    <256>   DW_AT_data_member_location: 130
 <2><257>: Abbrev Number: 15 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0xe8): _shortbuf
    <25c>   DW_AT_decl_file   : 6
    <25d>   DW_AT_decl_line   : 79
    <25e>   DW_AT_decl_column : 8
    <25f>   DW_AT_type        : <0x2ff>
    <263>   DW_AT_data_member_location: 131
 <2><264>: Abbrev Number: 15 (DW_TAG_member)
    <265>   DW_AT_name        : (indirect string, offset: 0x2ef): _lock
    <269>   DW_AT_decl_file   : 6
    <26a>   DW_AT_decl_line   : 81
    <26b>   DW_AT_decl_column : 15
    <26c>   DW_AT_type        : <0x30f>
    <270>   DW_AT_data_member_location: 136
 <2><271>: Abbrev Number: 15 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x11b6): _offset
    <276>   DW_AT_decl_file   : 6
    <277>   DW_AT_decl_line   : 89
    <278>   DW_AT_decl_column : 13
    <279>   DW_AT_type        : <0x9a>
    <27d>   DW_AT_data_member_location: 144
 <2><27e>: Abbrev Number: 15 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0x180d): _codecvt
    <283>   DW_AT_decl_file   : 6
    <284>   DW_AT_decl_line   : 91
    <285>   DW_AT_decl_column : 23
    <286>   DW_AT_type        : <0x31a>
    <28a>   DW_AT_data_member_location: 152
 <2><28b>: Abbrev Number: 15 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0xbe3): _wide_data
    <290>   DW_AT_decl_file   : 6
    <291>   DW_AT_decl_line   : 92
    <292>   DW_AT_decl_column : 25
    <293>   DW_AT_type        : <0x325>
    <297>   DW_AT_data_member_location: 160
 <2><298>: Abbrev Number: 15 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x1b7e): _freeres_list
    <29d>   DW_AT_decl_file   : 6
    <29e>   DW_AT_decl_line   : 93
    <29f>   DW_AT_decl_column : 20
    <2a0>   DW_AT_type        : <0x2f9>
    <2a4>   DW_AT_data_member_location: 168
 <2><2a5>: Abbrev Number: 15 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x19d7): _freeres_buf
    <2aa>   DW_AT_decl_file   : 6
    <2ab>   DW_AT_decl_line   : 94
    <2ac>   DW_AT_decl_column : 9
    <2ad>   DW_AT_type        : <0xb6>
    <2b1>   DW_AT_data_member_location: 176
 <2><2b2>: Abbrev Number: 15 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x1769): __pad5
    <2b7>   DW_AT_decl_file   : 6
    <2b8>   DW_AT_decl_line   : 95
    <2b9>   DW_AT_decl_column : 10
    <2ba>   DW_AT_type        : <0xe5>
    <2be>   DW_AT_data_member_location: 184
 <2><2bf>: Abbrev Number: 15 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x1223): _mode
    <2c4>   DW_AT_decl_file   : 6
    <2c5>   DW_AT_decl_line   : 96
    <2c6>   DW_AT_decl_column : 7
    <2c7>   DW_AT_type        : <0x6f>
    <2cb>   DW_AT_data_member_location: 192
 <2><2cc>: Abbrev Number: 15 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x14): _unused2
    <2d1>   DW_AT_decl_file   : 6
    <2d2>   DW_AT_decl_line   : 98
    <2d3>   DW_AT_decl_column : 8
    <2d4>   DW_AT_type        : <0x32b>
    <2d8>   DW_AT_data_member_location: 196
 <2><2d9>: Abbrev Number: 0
 <1><2da>: Abbrev Number: 3 (DW_TAG_typedef)
    <2db>   DW_AT_name        : (indirect string, offset: 0x97d): FILE
    <2df>   DW_AT_decl_file   : 7
    <2e0>   DW_AT_decl_line   : 7
    <2e1>   DW_AT_decl_column : 25
    <2e2>   DW_AT_type        : <0x153>
 <1><2e6>: Abbrev Number: 16 (DW_TAG_typedef)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x76e): _IO_lock_t
    <2eb>   DW_AT_decl_file   : 6
    <2ec>   DW_AT_decl_line   : 43
    <2ed>   DW_AT_decl_column : 14
 <1><2ee>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x135e): _IO_marker
    <2f3>   DW_AT_declaration : 1
 <1><2f3>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <2f4>   DW_AT_byte_size   : 8
    <2f5>   DW_AT_type        : <0x2ee>
 <1><2f9>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <2fa>   DW_AT_byte_size   : 8
    <2fb>   DW_AT_type        : <0x153>
 <1><2ff>: Abbrev Number: 6 (DW_TAG_array_type)
    <300>   DW_AT_type        : <0xbe>
    <304>   DW_AT_sibling     : <0x30f>
 <2><308>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <309>   DW_AT_type        : <0x42>
    <30d>   DW_AT_upper_bound : 0
 <2><30e>: Abbrev Number: 0
 <1><30f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <310>   DW_AT_byte_size   : 8
    <311>   DW_AT_type        : <0x2e6>
 <1><315>: Abbrev Number: 17 (DW_TAG_structure_type)
    <316>   DW_AT_name        : (indirect string, offset: 0x143c): _IO_codecvt
    <31a>   DW_AT_declaration : 1
 <1><31a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <31b>   DW_AT_byte_size   : 8
    <31c>   DW_AT_type        : <0x315>
 <1><320>: Abbrev Number: 17 (DW_TAG_structure_type)
    <321>   DW_AT_name        : (indirect string, offset: 0x1680): _IO_wide_data
    <325>   DW_AT_declaration : 1
 <1><325>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <326>   DW_AT_byte_size   : 8
    <327>   DW_AT_type        : <0x320>
 <1><32b>: Abbrev Number: 6 (DW_TAG_array_type)
    <32c>   DW_AT_type        : <0xbe>
    <330>   DW_AT_sibling     : <0x33b>
 <2><334>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <335>   DW_AT_type        : <0x42>
    <339>   DW_AT_upper_bound : 19
 <2><33a>: Abbrev Number: 0
 <1><33b>: Abbrev Number: 3 (DW_TAG_typedef)
    <33c>   DW_AT_name        : (indirect string, offset: 0x920): va_list
    <340>   DW_AT_decl_file   : 8
    <341>   DW_AT_decl_line   : 52
    <342>   DW_AT_decl_column : 24
    <343>   DW_AT_type        : <0xf1>
 <1><347>: Abbrev Number: 18 (DW_TAG_variable)
    <348>   DW_AT_name        : (indirect string, offset: 0x1586): stdin
    <34c>   DW_AT_decl_file   : 8
    <34d>   DW_AT_decl_line   : 137
    <34e>   DW_AT_decl_column : 14
    <34f>   DW_AT_type        : <0x353>
    <353>   DW_AT_external    : 1
    <353>   DW_AT_declaration : 1
 <1><353>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <354>   DW_AT_byte_size   : 8
    <355>   DW_AT_type        : <0x2da>
 <1><359>: Abbrev Number: 18 (DW_TAG_variable)
    <35a>   DW_AT_name        : (indirect string, offset: 0xfe4): stdout
    <35e>   DW_AT_decl_file   : 8
    <35f>   DW_AT_decl_line   : 138
    <360>   DW_AT_decl_column : 14
    <361>   DW_AT_type        : <0x353>
    <365>   DW_AT_external    : 1
    <365>   DW_AT_declaration : 1
 <1><365>: Abbrev Number: 18 (DW_TAG_variable)
    <366>   DW_AT_name        : (indirect string, offset: 0xf21): stderr
    <36a>   DW_AT_decl_file   : 8
    <36b>   DW_AT_decl_line   : 139
    <36c>   DW_AT_decl_column : 14
    <36d>   DW_AT_type        : <0x353>
    <371>   DW_AT_external    : 1
    <371>   DW_AT_declaration : 1
 <1><371>: Abbrev Number: 18 (DW_TAG_variable)
    <372>   DW_AT_name        : (indirect string, offset: 0x1ce2): sys_nerr
    <376>   DW_AT_decl_file   : 10
    <377>   DW_AT_decl_line   : 26
    <378>   DW_AT_decl_column : 12
    <379>   DW_AT_type        : <0x6f>
    <37d>   DW_AT_external    : 1
    <37d>   DW_AT_declaration : 1
 <1><37d>: Abbrev Number: 6 (DW_TAG_array_type)
    <37e>   DW_AT_type        : <0x393>
    <382>   DW_AT_sibling     : <0x388>
 <2><386>: Abbrev Number: 19 (DW_TAG_subrange_type)
 <2><387>: Abbrev Number: 0
 <1><388>: Abbrev Number: 5 (DW_TAG_const_type)
    <389>   DW_AT_type        : <0x37d>
 <1><38d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <38e>   DW_AT_byte_size   : 8
    <38f>   DW_AT_type        : <0xc5>
 <1><393>: Abbrev Number: 5 (DW_TAG_const_type)
    <394>   DW_AT_type        : <0x38d>
 <1><398>: Abbrev Number: 18 (DW_TAG_variable)
    <399>   DW_AT_name        : (indirect string, offset: 0x5d2): sys_errlist
    <39d>   DW_AT_decl_file   : 10
    <39e>   DW_AT_decl_line   : 27
    <39f>   DW_AT_decl_column : 26
    <3a0>   DW_AT_type        : <0x388>
    <3a4>   DW_AT_external    : 1
    <3a4>   DW_AT_declaration : 1
 <1><3a4>: Abbrev Number: 2 (DW_TAG_base_type)
    <3a5>   DW_AT_byte_size   : 8
    <3a6>   DW_AT_encoding    : 5	(signed)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x1c38): long long int
 <1><3ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x3cd): int32_t
    <3b0>   DW_AT_decl_file   : 11
    <3b1>   DW_AT_decl_line   : 26
    <3b2>   DW_AT_decl_column : 19
    <3b3>   DW_AT_type        : <0x63>
 <1><3b7>: Abbrev Number: 2 (DW_TAG_base_type)
    <3b8>   DW_AT_byte_size   : 8
    <3b9>   DW_AT_encoding    : 7	(unsigned)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x1a38): long long unsigned int
 <1><3be>: Abbrev Number: 6 (DW_TAG_array_type)
    <3bf>   DW_AT_type        : <0xbe>
    <3c3>   DW_AT_sibling     : <0x3ce>
 <2><3c7>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <3c8>   DW_AT_type        : <0x42>
    <3cc>   DW_AT_upper_bound : 31
 <2><3cd>: Abbrev Number: 0
 <1><3ce>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3cf>   DW_AT_byte_size   : 8
    <3d0>   DW_AT_type        : <0x3ab>
 <1><3d4>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d5>   DW_AT_byte_size   : 16
    <3d6>   DW_AT_encoding    : 4	(float)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x148b): long double
 <1><3db>: Abbrev Number: 6 (DW_TAG_array_type)
    <3dc>   DW_AT_type        : <0xb8>
    <3e0>   DW_AT_sibling     : <0x3eb>
 <2><3e4>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <3e5>   DW_AT_type        : <0x42>
    <3e9>   DW_AT_upper_bound : 1
 <2><3ea>: Abbrev Number: 0
 <1><3eb>: Abbrev Number: 18 (DW_TAG_variable)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x4db): __tzname
    <3f0>   DW_AT_decl_file   : 12
    <3f1>   DW_AT_decl_line   : 159
    <3f2>   DW_AT_decl_column : 14
    <3f3>   DW_AT_type        : <0x3db>
    <3f7>   DW_AT_external    : 1
    <3f7>   DW_AT_declaration : 1
 <1><3f7>: Abbrev Number: 18 (DW_TAG_variable)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x190f): __daylight
    <3fc>   DW_AT_decl_file   : 12
    <3fd>   DW_AT_decl_line   : 160
    <3fe>   DW_AT_decl_column : 12
    <3ff>   DW_AT_type        : <0x6f>
    <403>   DW_AT_external    : 1
    <403>   DW_AT_declaration : 1
 <1><403>: Abbrev Number: 18 (DW_TAG_variable)
    <404>   DW_AT_name        : (indirect string, offset: 0xe4b): __timezone
    <408>   DW_AT_decl_file   : 12
    <409>   DW_AT_decl_line   : 161
    <40a>   DW_AT_decl_column : 17
    <40b>   DW_AT_type        : <0x87>
    <40f>   DW_AT_external    : 1
    <40f>   DW_AT_declaration : 1
 <1><40f>: Abbrev Number: 18 (DW_TAG_variable)
    <410>   DW_AT_name        : (indirect string, offset: 0x169b): tzname
    <414>   DW_AT_decl_file   : 12
    <415>   DW_AT_decl_line   : 166
    <416>   DW_AT_decl_column : 14
    <417>   DW_AT_type        : <0x3db>
    <41b>   DW_AT_external    : 1
    <41b>   DW_AT_declaration : 1
 <1><41b>: Abbrev Number: 18 (DW_TAG_variable)
    <41c>   DW_AT_name        : (indirect string, offset: 0x5e5): daylight
    <420>   DW_AT_decl_file   : 12
    <421>   DW_AT_decl_line   : 174
    <422>   DW_AT_decl_column : 12
    <423>   DW_AT_type        : <0x6f>
    <427>   DW_AT_external    : 1
    <427>   DW_AT_declaration : 1
 <1><427>: Abbrev Number: 18 (DW_TAG_variable)
    <428>   DW_AT_name        : (indirect string, offset: 0x1bc0): timezone
    <42c>   DW_AT_decl_file   : 12
    <42d>   DW_AT_decl_line   : 175
    <42e>   DW_AT_decl_column : 17
    <42f>   DW_AT_type        : <0x87>
    <433>   DW_AT_external    : 1
    <433>   DW_AT_declaration : 1
 <1><433>: Abbrev Number: 3 (DW_TAG_typedef)
    <434>   DW_AT_name        : (indirect string, offset: 0x1b8): uint16_t
    <438>   DW_AT_decl_file   : 13
    <439>   DW_AT_decl_line   : 25
    <43a>   DW_AT_decl_column : 20
    <43b>   DW_AT_type        : <0x57>
 <1><43f>: Abbrev Number: 3 (DW_TAG_typedef)
    <440>   DW_AT_name        : (indirect string, offset: 0x1410): uint32_t
    <444>   DW_AT_decl_file   : 13
    <445>   DW_AT_decl_line   : 26
    <446>   DW_AT_decl_column : 20
    <447>   DW_AT_type        : <0x7b>
 <1><44b>: Abbrev Number: 3 (DW_TAG_typedef)
    <44c>   DW_AT_name        : (indirect string, offset: 0x13f1): intptr_t
    <450>   DW_AT_decl_file   : 14
    <451>   DW_AT_decl_line   : 87
    <452>   DW_AT_decl_column : 19
    <453>   DW_AT_type        : <0x87>
 <1><457>: Abbrev Number: 3 (DW_TAG_typedef)
    <458>   DW_AT_name        : (indirect string, offset: 0x49d): byte
    <45c>   DW_AT_decl_file   : 15
    <45d>   DW_AT_decl_line   : 185
    <45e>   DW_AT_decl_column : 23
    <45f>   DW_AT_type        : <0x2d>
 <1><463>: Abbrev Number: 5 (DW_TAG_const_type)
    <464>   DW_AT_type        : <0x457>
 <1><468>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <469>   DW_AT_encoding    : 7	(unsigned)
    <46a>   DW_AT_byte_size   : 4
    <46b>   DW_AT_type        : <0x3b>
    <46f>   DW_AT_decl_file   : 15
    <470>   DW_AT_decl_line   : 187
    <471>   DW_AT_decl_column : 14
    <472>   DW_AT_sibling     : <0x483>
 <2><476>: Abbrev Number: 21 (DW_TAG_enumerator)
    <477>   DW_AT_name        : (indirect string, offset: 0x1d4b): qfalse
    <47b>   DW_AT_const_value : 0
 <2><47c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <47d>   DW_AT_name        : (indirect string, offset: 0x12d6): qtrue
    <481>   DW_AT_const_value : 1
 <2><482>: Abbrev Number: 0
 <1><483>: Abbrev Number: 3 (DW_TAG_typedef)
    <484>   DW_AT_name        : (indirect string, offset: 0xf28): qboolean
    <488>   DW_AT_decl_file   : 15
    <489>   DW_AT_decl_line   : 187
    <48a>   DW_AT_decl_column : 36
    <48b>   DW_AT_type        : <0x468>
 <1><48f>: Abbrev Number: 6 (DW_TAG_array_type)
    <490>   DW_AT_type        : <0x457>
    <494>   DW_AT_sibling     : <0x49f>
 <2><498>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <499>   DW_AT_type        : <0x42>
    <49d>   DW_AT_upper_bound : 3
 <2><49e>: Abbrev Number: 0
 <1><49f>: Abbrev Number: 3 (DW_TAG_typedef)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x170a): fileHandle_t
    <4a4>   DW_AT_decl_file   : 15
    <4a5>   DW_AT_decl_line   : 206
    <4a6>   DW_AT_decl_column : 14
    <4a7>   DW_AT_type        : <0x6f>
 <1><4ab>: Abbrev Number: 22 (DW_TAG_typedef)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x435): vec_t
    <4b0>   DW_AT_decl_file   : 15
    <4b1>   DW_AT_decl_line   : 368
    <4b3>   DW_AT_decl_column : 15
    <4b4>   DW_AT_type        : <0xca>
 <1><4b8>: Abbrev Number: 5 (DW_TAG_const_type)
    <4b9>   DW_AT_type        : <0x4ab>
 <1><4bd>: Abbrev Number: 22 (DW_TAG_typedef)
    <4be>   DW_AT_name        : (indirect string, offset: 0x11a1): vec3_t
    <4c2>   DW_AT_decl_file   : 15
    <4c3>   DW_AT_decl_line   : 370
    <4c5>   DW_AT_decl_column : 15
    <4c6>   DW_AT_type        : <0x4ca>
 <1><4ca>: Abbrev Number: 6 (DW_TAG_array_type)
    <4cb>   DW_AT_type        : <0x4ab>
    <4cf>   DW_AT_sibling     : <0x4da>
 <2><4d3>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <4d4>   DW_AT_type        : <0x42>
    <4d8>   DW_AT_upper_bound : 2
 <2><4d9>: Abbrev Number: 0
 <1><4da>: Abbrev Number: 22 (DW_TAG_typedef)
    <4db>   DW_AT_name        : (indirect string, offset: 0x14f6): vec4_t
    <4df>   DW_AT_decl_file   : 15
    <4e0>   DW_AT_decl_line   : 371
    <4e2>   DW_AT_decl_column : 15
    <4e3>   DW_AT_type        : <0x4e7>
 <1><4e7>: Abbrev Number: 6 (DW_TAG_array_type)
    <4e8>   DW_AT_type        : <0x4ab>
    <4ec>   DW_AT_sibling     : <0x4f7>
 <2><4f0>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <4f1>   DW_AT_type        : <0x42>
    <4f5>   DW_AT_upper_bound : 3
 <2><4f6>: Abbrev Number: 0
 <1><4f7>: Abbrev Number: 6 (DW_TAG_array_type)
    <4f8>   DW_AT_type        : <0x4ab>
    <4fc>   DW_AT_sibling     : <0x50d>
 <2><500>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <501>   DW_AT_type        : <0x42>
    <505>   DW_AT_upper_bound : 161
 <2><506>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <507>   DW_AT_type        : <0x42>
    <50b>   DW_AT_upper_bound : 2
 <2><50c>: Abbrev Number: 0
 <1><50d>: Abbrev Number: 10 (DW_TAG_variable)
    <50e>   DW_AT_name        : (indirect string, offset: 0x35c): bytedirs
    <512>   DW_AT_decl_file   : 15
    <513>   DW_AT_decl_line   : 401
    <515>   DW_AT_decl_column : 15
    <516>   DW_AT_type        : <0x4f7>
    <51a>   DW_AT_external    : 1
    <51a>   DW_AT_declaration : 1
 <1><51a>: Abbrev Number: 10 (DW_TAG_variable)
    <51b>   DW_AT_name        : (indirect string, offset: 0x28): colorBlack
    <51f>   DW_AT_decl_file   : 15
    <520>   DW_AT_decl_line   : 420
    <522>   DW_AT_decl_column : 16
    <523>   DW_AT_type        : <0x4da>
    <527>   DW_AT_external    : 1
    <527>   DW_AT_declaration : 1
 <1><527>: Abbrev Number: 10 (DW_TAG_variable)
    <528>   DW_AT_name        : (indirect string, offset: 0x72a): colorRed
    <52c>   DW_AT_decl_file   : 15
    <52d>   DW_AT_decl_line   : 421
    <52f>   DW_AT_decl_column : 16
    <530>   DW_AT_type        : <0x4da>
    <534>   DW_AT_external    : 1
    <534>   DW_AT_declaration : 1
 <1><534>: Abbrev Number: 10 (DW_TAG_variable)
    <535>   DW_AT_name        : (indirect string, offset: 0x1bfa): colorGreen
    <539>   DW_AT_decl_file   : 15
    <53a>   DW_AT_decl_line   : 422
    <53c>   DW_AT_decl_column : 16
    <53d>   DW_AT_type        : <0x4da>
    <541>   DW_AT_external    : 1
    <541>   DW_AT_declaration : 1
 <1><541>: Abbrev Number: 10 (DW_TAG_variable)
    <542>   DW_AT_name        : (indirect string, offset: 0x6dd): colorBlue
    <546>   DW_AT_decl_file   : 15
    <547>   DW_AT_decl_line   : 423
    <549>   DW_AT_decl_column : 16
    <54a>   DW_AT_type        : <0x4da>
    <54e>   DW_AT_external    : 1
    <54e>   DW_AT_declaration : 1
 <1><54e>: Abbrev Number: 10 (DW_TAG_variable)
    <54f>   DW_AT_name        : (indirect string, offset: 0x8d): colorYellow
    <553>   DW_AT_decl_file   : 15
    <554>   DW_AT_decl_line   : 424
    <556>   DW_AT_decl_column : 16
    <557>   DW_AT_type        : <0x4da>
    <55b>   DW_AT_external    : 1
    <55b>   DW_AT_declaration : 1
 <1><55b>: Abbrev Number: 10 (DW_TAG_variable)
    <55c>   DW_AT_name        : (indirect string, offset: 0x1292): colorMagenta
    <560>   DW_AT_decl_file   : 15
    <561>   DW_AT_decl_line   : 425
    <563>   DW_AT_decl_column : 16
    <564>   DW_AT_type        : <0x4da>
    <568>   DW_AT_external    : 1
    <568>   DW_AT_declaration : 1
 <1><568>: Abbrev Number: 10 (DW_TAG_variable)
    <569>   DW_AT_name        : (indirect string, offset: 0x1466): colorCyan
    <56d>   DW_AT_decl_file   : 15
    <56e>   DW_AT_decl_line   : 426
    <570>   DW_AT_decl_column : 16
    <571>   DW_AT_type        : <0x4da>
    <575>   DW_AT_external    : 1
    <575>   DW_AT_declaration : 1
 <1><575>: Abbrev Number: 10 (DW_TAG_variable)
    <576>   DW_AT_name        : (indirect string, offset: 0x165c): colorWhite
    <57a>   DW_AT_decl_file   : 15
    <57b>   DW_AT_decl_line   : 427
    <57d>   DW_AT_decl_column : 16
    <57e>   DW_AT_type        : <0x4da>
    <582>   DW_AT_external    : 1
    <582>   DW_AT_declaration : 1
 <1><582>: Abbrev Number: 10 (DW_TAG_variable)
    <583>   DW_AT_name        : (indirect string, offset: 0x1753): colorLtGrey
    <587>   DW_AT_decl_file   : 15
    <588>   DW_AT_decl_line   : 428
    <58a>   DW_AT_decl_column : 16
    <58b>   DW_AT_type        : <0x4da>
    <58f>   DW_AT_external    : 1
    <58f>   DW_AT_declaration : 1
 <1><58f>: Abbrev Number: 10 (DW_TAG_variable)
    <590>   DW_AT_name        : (indirect string, offset: 0x1674): colorMdGrey
    <594>   DW_AT_decl_file   : 15
    <595>   DW_AT_decl_line   : 429
    <597>   DW_AT_decl_column : 16
    <598>   DW_AT_type        : <0x4da>
    <59c>   DW_AT_external    : 1
    <59c>   DW_AT_declaration : 1
 <1><59c>: Abbrev Number: 10 (DW_TAG_variable)
    <59d>   DW_AT_name        : (indirect string, offset: 0x16e1): colorDkGrey
    <5a1>   DW_AT_decl_file   : 15
    <5a2>   DW_AT_decl_line   : 430
    <5a4>   DW_AT_decl_column : 16
    <5a5>   DW_AT_type        : <0x4da>
    <5a9>   DW_AT_external    : 1
    <5a9>   DW_AT_declaration : 1
 <1><5a9>: Abbrev Number: 6 (DW_TAG_array_type)
    <5aa>   DW_AT_type        : <0x4b8>
    <5ae>   DW_AT_sibling     : <0x5bf>
 <2><5b2>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <5b3>   DW_AT_type        : <0x42>
    <5b7>   DW_AT_upper_bound : 63
 <2><5b8>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <5b9>   DW_AT_type        : <0x42>
    <5bd>   DW_AT_upper_bound : 3
 <2><5be>: Abbrev Number: 0
 <1><5bf>: Abbrev Number: 5 (DW_TAG_const_type)
    <5c0>   DW_AT_type        : <0x5a9>
 <1><5c4>: Abbrev Number: 10 (DW_TAG_variable)
    <5c5>   DW_AT_name        : (indirect string, offset: 0xa80): g_color_table
    <5c9>   DW_AT_decl_file   : 15
    <5ca>   DW_AT_decl_line   : 454
    <5cc>   DW_AT_decl_column : 21
    <5cd>   DW_AT_type        : <0x5bf>
    <5d1>   DW_AT_external    : 1
    <5d1>   DW_AT_declaration : 1
 <1><5d1>: Abbrev Number: 10 (DW_TAG_variable)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x37c): vec3_origin
    <5d6>   DW_AT_decl_file   : 15
    <5d7>   DW_AT_decl_line   : 465
    <5d9>   DW_AT_decl_column : 15
    <5da>   DW_AT_type        : <0x4bd>
    <5de>   DW_AT_external    : 1
    <5de>   DW_AT_declaration : 1
 <1><5de>: Abbrev Number: 6 (DW_TAG_array_type)
    <5df>   DW_AT_type        : <0x4ab>
    <5e3>   DW_AT_sibling     : <0x5f4>
 <2><5e7>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <5e8>   DW_AT_type        : <0x42>
    <5ec>   DW_AT_upper_bound : 2
 <2><5ed>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <5ee>   DW_AT_type        : <0x42>
    <5f2>   DW_AT_upper_bound : 2
 <2><5f3>: Abbrev Number: 0
 <1><5f4>: Abbrev Number: 10 (DW_TAG_variable)
    <5f5>   DW_AT_name        : (indirect string, offset: 0x1619): axisDefault
    <5f9>   DW_AT_decl_file   : 15
    <5fa>   DW_AT_decl_line   : 466
    <5fc>   DW_AT_decl_column : 15
    <5fd>   DW_AT_type        : <0x5de>
    <601>   DW_AT_external    : 1
    <601>   DW_AT_declaration : 1
 <1><601>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <602>   DW_AT_encoding    : 7	(unsigned)
    <603>   DW_AT_byte_size   : 4
    <604>   DW_AT_type        : <0x3b>
    <608>   DW_AT_decl_file   : 15
    <609>   DW_AT_decl_line   : 714
    <60b>   DW_AT_decl_column : 14
    <60c>   DW_AT_sibling     : <0x671>
 <2><610>: Abbrev Number: 21 (DW_TAG_enumerator)
    <611>   DW_AT_name        : (indirect string, offset: 0x132a): TK_GENEGIC
    <615>   DW_AT_const_value : 0
 <2><616>: Abbrev Number: 21 (DW_TAG_enumerator)
    <617>   DW_AT_name        : (indirect string, offset: 0x547): TK_STRING
    <61b>   DW_AT_const_value : 1
 <2><61c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <61d>   DW_AT_name        : (indirect string, offset: 0x1f67): TK_QUOTED
    <621>   DW_AT_const_value : 2
 <2><622>: Abbrev Number: 21 (DW_TAG_enumerator)
    <623>   DW_AT_name        : (indirect string, offset: 0x1580): TK_EQ
    <627>   DW_AT_const_value : 3
 <2><628>: Abbrev Number: 21 (DW_TAG_enumerator)
    <629>   DW_AT_name        : (indirect string, offset: 0x9dd): TK_NEQ
    <62d>   DW_AT_const_value : 4
 <2><62e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <62f>   DW_AT_name        : (indirect string, offset: 0x16cd): TK_GT
    <633>   DW_AT_const_value : 5
 <2><634>: Abbrev Number: 21 (DW_TAG_enumerator)
    <635>   DW_AT_name        : (indirect string, offset: 0x1c7a): TK_GTE
    <639>   DW_AT_const_value : 6
 <2><63a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <63b>   DW_AT_name        : (indirect string, offset: 0x1930): TK_LT
    <63f>   DW_AT_const_value : 7
 <2><640>: Abbrev Number: 21 (DW_TAG_enumerator)
    <641>   DW_AT_name        : (indirect string, offset: 0xbcc): TK_LTE
    <645>   DW_AT_const_value : 8
 <2><646>: Abbrev Number: 21 (DW_TAG_enumerator)
    <647>   DW_AT_name        : (indirect string, offset: 0x7db): TK_MATCH
    <64b>   DW_AT_const_value : 9
 <2><64c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <64d>   DW_AT_name        : (indirect string, offset: 0x1ab6): TK_OR
    <651>   DW_AT_const_value : 10
 <2><652>: Abbrev Number: 21 (DW_TAG_enumerator)
    <653>   DW_AT_name        : (indirect string, offset: 0x709): TK_AND
    <657>   DW_AT_const_value : 11
 <2><658>: Abbrev Number: 21 (DW_TAG_enumerator)
    <659>   DW_AT_name        : (indirect string, offset: 0x1770): TK_SCOPE_OPEN
    <65d>   DW_AT_const_value : 12
 <2><65e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <65f>   DW_AT_name        : (indirect string, offset: 0x937): TK_SCOPE_CLOSE
    <663>   DW_AT_const_value : 13
 <2><664>: Abbrev Number: 21 (DW_TAG_enumerator)
    <665>   DW_AT_name        : (indirect string, offset: 0x49): TK_NEWLINE
    <669>   DW_AT_const_value : 14
 <2><66a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <66b>   DW_AT_name        : (indirect string, offset: 0x1409): TK_EOF
    <66f>   DW_AT_const_value : 15
 <2><670>: Abbrev Number: 0
 <1><671>: Abbrev Number: 22 (DW_TAG_typedef)
    <672>   DW_AT_name        : (indirect string, offset: 0x14bf): tokenType_t
    <676>   DW_AT_decl_file   : 15
    <677>   DW_AT_decl_line   : 731
    <679>   DW_AT_decl_column : 3
    <67a>   DW_AT_type        : <0x601>
 <1><67e>: Abbrev Number: 10 (DW_TAG_variable)
    <67f>   DW_AT_name        : (indirect string, offset: 0x1273): com_tokentype
    <683>   DW_AT_decl_file   : 15
    <684>   DW_AT_decl_line   : 733
    <686>   DW_AT_decl_column : 20
    <687>   DW_AT_type        : <0x671>
    <68b>   DW_AT_external    : 1
    <68b>   DW_AT_declaration : 1
 <1><68b>: Abbrev Number: 6 (DW_TAG_array_type)
    <68c>   DW_AT_type        : <0xbe>
    <690>   DW_AT_sibling     : <0x69c>
 <2><694>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <695>   DW_AT_type        : <0x42>
    <699>   DW_AT_upper_bound : 1023
 <2><69b>: Abbrev Number: 0
 <1><69c>: Abbrev Number: 6 (DW_TAG_array_type)
    <69d>   DW_AT_type        : <0x463>
    <6a1>   DW_AT_sibling     : <0x6ac>
 <2><6a5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <6a6>   DW_AT_type        : <0x42>
    <6aa>   DW_AT_upper_bound : 255
 <2><6ab>: Abbrev Number: 0
 <1><6ac>: Abbrev Number: 5 (DW_TAG_const_type)
    <6ad>   DW_AT_type        : <0x69c>
 <1><6b1>: Abbrev Number: 10 (DW_TAG_variable)
    <6b2>   DW_AT_name        : (indirect string, offset: 0x890): locase
    <6b6>   DW_AT_decl_file   : 15
    <6b7>   DW_AT_decl_line   : 791
    <6b9>   DW_AT_decl_column : 19
    <6ba>   DW_AT_type        : <0x6ac>
    <6be>   DW_AT_external    : 1
    <6be>   DW_AT_declaration : 1
 <1><6be>: Abbrev Number: 22 (DW_TAG_typedef)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x1b22): syscall_t
    <6c3>   DW_AT_decl_file   : 15
    <6c4>   DW_AT_decl_line   : 842
    <6c6>   DW_AT_decl_column : 20
    <6c7>   DW_AT_type        : <0x6cb>
 <1><6cb>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <6cc>   DW_AT_byte_size   : 8
    <6cd>   DW_AT_type        : <0x6d1>
 <1><6d1>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <6d2>   DW_AT_prototyped  : 1
    <6d2>   DW_AT_type        : <0x44b>
    <6d6>   DW_AT_sibling     : <0x6e0>
 <2><6da>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <6db>   DW_AT_type        : <0x6e0>
 <2><6df>: Abbrev Number: 0
 <1><6e0>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <6e1>   DW_AT_byte_size   : 8
    <6e2>   DW_AT_type        : <0x44b>
 <1><6e6>: Abbrev Number: 22 (DW_TAG_typedef)
    <6e7>   DW_AT_name        : (indirect string, offset: 0xe7b): dllSyscall_t
    <6eb>   DW_AT_decl_file   : 15
    <6ec>   DW_AT_decl_line   : 843
    <6ee>   DW_AT_decl_column : 26
    <6ef>   DW_AT_type        : <0x6f3>
 <1><6f3>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <6f4>   DW_AT_byte_size   : 8
    <6f5>   DW_AT_type        : <0x6f9>
 <1><6f9>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <6fa>   DW_AT_prototyped  : 1
    <6fa>   DW_AT_type        : <0x44b>
    <6fe>   DW_AT_sibling     : <0x709>
 <2><702>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <703>   DW_AT_type        : <0x44b>
 <2><707>: Abbrev Number: 27 (DW_TAG_unspecified_parameters)
 <2><708>: Abbrev Number: 0
 <1><709>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <70a>   DW_AT_encoding    : 7	(unsigned)
    <70b>   DW_AT_byte_size   : 4
    <70c>   DW_AT_type        : <0x3b>
    <710>   DW_AT_decl_file   : 15
    <711>   DW_AT_decl_line   : 931
    <713>   DW_AT_decl_column : 14
    <714>   DW_AT_sibling     : <0x737>
 <2><718>: Abbrev Number: 21 (DW_TAG_enumerator)
    <719>   DW_AT_name        : (indirect string, offset: 0x1d89): CV_NONE
    <71d>   DW_AT_const_value : 0
 <2><71e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <71f>   DW_AT_name        : (indirect string, offset: 0x1dc3): CV_FLOAT
    <723>   DW_AT_const_value : 1
 <2><724>: Abbrev Number: 21 (DW_TAG_enumerator)
    <725>   DW_AT_name        : (indirect string, offset: 0x1bb5): CV_INTEGER
    <729>   DW_AT_const_value : 2
 <2><72a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <72b>   DW_AT_name        : (indirect string, offset: 0x1792): CV_FSPATH
    <72f>   DW_AT_const_value : 3
 <2><730>: Abbrev Number: 21 (DW_TAG_enumerator)
    <731>   DW_AT_name        : (indirect string, offset: 0x15d2): CV_MAX
    <735>   DW_AT_const_value : 4
 <2><736>: Abbrev Number: 0
 <1><737>: Abbrev Number: 22 (DW_TAG_typedef)
    <738>   DW_AT_name        : (indirect string, offset: 0xe88): cvarValidator_t
    <73c>   DW_AT_decl_file   : 15
    <73d>   DW_AT_decl_line   : 937
    <73f>   DW_AT_decl_column : 3
    <740>   DW_AT_type        : <0x709>
 <1><744>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <745>   DW_AT_encoding    : 7	(unsigned)
    <746>   DW_AT_byte_size   : 4
    <747>   DW_AT_type        : <0x3b>
    <74b>   DW_AT_decl_file   : 15
    <74c>   DW_AT_decl_line   : 939
    <74e>   DW_AT_decl_column : 14
    <74f>   DW_AT_sibling     : <0x76c>
 <2><753>: Abbrev Number: 21 (DW_TAG_enumerator)
    <754>   DW_AT_name        : (indirect string, offset: 0x779): CVG_NONE
    <758>   DW_AT_const_value : 0
 <2><759>: Abbrev Number: 21 (DW_TAG_enumerator)
    <75a>   DW_AT_name        : (indirect string, offset: 0x32b): CVG_RENDERER
    <75e>   DW_AT_const_value : 1
 <2><75f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <760>   DW_AT_name        : (indirect string, offset: 0x1e98): CVG_SERVER
    <764>   DW_AT_const_value : 2
 <2><765>: Abbrev Number: 21 (DW_TAG_enumerator)
    <766>   DW_AT_name        : (indirect string, offset: 0x701): CVG_MAX
    <76a>   DW_AT_const_value : 3
 <2><76b>: Abbrev Number: 0
 <1><76c>: Abbrev Number: 22 (DW_TAG_typedef)
    <76d>   DW_AT_name        : (indirect string, offset: 0x1217): cvarGroup_t
    <771>   DW_AT_decl_file   : 15
    <772>   DW_AT_decl_line   : 944
    <774>   DW_AT_decl_column : 3
    <775>   DW_AT_type        : <0x744>
 <1><779>: Abbrev Number: 22 (DW_TAG_typedef)
    <77a>   DW_AT_name        : (indirect string, offset: 0x1539): cvar_t
    <77e>   DW_AT_decl_file   : 15
    <77f>   DW_AT_decl_line   : 947
    <781>   DW_AT_decl_column : 23
    <782>   DW_AT_type        : <0x786>
 <1><786>: Abbrev Number: 28 (DW_TAG_structure_type)
    <787>   DW_AT_name        : (indirect string, offset: 0x1532): cvar_s
    <78b>   DW_AT_byte_size   : 120
    <78c>   DW_AT_decl_file   : 15
    <78d>   DW_AT_decl_line   : 949
    <78f>   DW_AT_decl_column : 8
    <790>   DW_AT_sibling     : <0x89f>
 <2><794>: Abbrev Number: 29 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0xf3f): name
    <799>   DW_AT_decl_file   : 15
    <79a>   DW_AT_decl_line   : 950
    <79c>   DW_AT_decl_column : 9
    <79d>   DW_AT_type        : <0xb8>
    <7a1>   DW_AT_data_member_location: 0
 <2><7a2>: Abbrev Number: 29 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0x11be): string
    <7a7>   DW_AT_decl_file   : 15
    <7a8>   DW_AT_decl_line   : 951
    <7aa>   DW_AT_decl_column : 9
    <7ab>   DW_AT_type        : <0xb8>
    <7af>   DW_AT_data_member_location: 8
 <2><7b0>: Abbrev Number: 29 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x8f4): resetString
    <7b5>   DW_AT_decl_file   : 15
    <7b6>   DW_AT_decl_line   : 952
    <7b8>   DW_AT_decl_column : 9
    <7b9>   DW_AT_type        : <0xb8>
    <7bd>   DW_AT_data_member_location: 16
 <2><7be>: Abbrev Number: 29 (DW_TAG_member)
    <7bf>   DW_AT_name        : (indirect string, offset: 0xf31): latchedString
    <7c3>   DW_AT_decl_file   : 15
    <7c4>   DW_AT_decl_line   : 953
    <7c6>   DW_AT_decl_column : 9
    <7c7>   DW_AT_type        : <0xb8>
    <7cb>   DW_AT_data_member_location: 24
 <2><7cc>: Abbrev Number: 29 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x1f49): flags
    <7d1>   DW_AT_decl_file   : 15
    <7d2>   DW_AT_decl_line   : 954
    <7d4>   DW_AT_decl_column : 8
    <7d5>   DW_AT_type        : <0x6f>
    <7d9>   DW_AT_data_member_location: 32
 <2><7da>: Abbrev Number: 29 (DW_TAG_member)
    <7db>   DW_AT_name        : (indirect string, offset: 0x1625): modified
    <7df>   DW_AT_decl_file   : 15
    <7e0>   DW_AT_decl_line   : 955
    <7e2>   DW_AT_decl_column : 11
    <7e3>   DW_AT_type        : <0x483>
    <7e7>   DW_AT_data_member_location: 36
 <2><7e8>: Abbrev Number: 29 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x551): modificationCount
    <7ed>   DW_AT_decl_file   : 15
    <7ee>   DW_AT_decl_line   : 956
    <7f0>   DW_AT_decl_column : 8
    <7f1>   DW_AT_type        : <0x6f>
    <7f5>   DW_AT_data_member_location: 40
 <2><7f6>: Abbrev Number: 29 (DW_TAG_member)
    <7f7>   DW_AT_name        : (indirect string, offset: 0xcf6): value
    <7fb>   DW_AT_decl_file   : 15
    <7fc>   DW_AT_decl_line   : 957
    <7fe>   DW_AT_decl_column : 9
    <7ff>   DW_AT_type        : <0xca>
    <803>   DW_AT_data_member_location: 44
 <2><804>: Abbrev Number: 29 (DW_TAG_member)
    <805>   DW_AT_name        : (indirect string, offset: 0xdba): integer
    <809>   DW_AT_decl_file   : 15
    <80a>   DW_AT_decl_line   : 958
    <80c>   DW_AT_decl_column : 8
    <80d>   DW_AT_type        : <0x6f>
    <811>   DW_AT_data_member_location: 48
 <2><812>: Abbrev Number: 29 (DW_TAG_member)
    <813>   DW_AT_name        : (indirect string, offset: 0x1f05): validator
    <817>   DW_AT_decl_file   : 15
    <818>   DW_AT_decl_line   : 959
    <81a>   DW_AT_decl_column : 18
    <81b>   DW_AT_type        : <0x737>
    <81f>   DW_AT_data_member_location: 52
 <2><820>: Abbrev Number: 29 (DW_TAG_member)
    <821>   DW_AT_name        : (indirect string, offset: 0x1950): mins
    <825>   DW_AT_decl_file   : 15
    <826>   DW_AT_decl_line   : 960
    <828>   DW_AT_decl_column : 9
    <829>   DW_AT_type        : <0xb8>
    <82d>   DW_AT_data_member_location: 56
 <2><82e>: Abbrev Number: 29 (DW_TAG_member)
    <82f>   DW_AT_name        : (indirect string, offset: 0x5be): maxs
    <833>   DW_AT_decl_file   : 15
    <834>   DW_AT_decl_line   : 961
    <836>   DW_AT_decl_column : 9
    <837>   DW_AT_type        : <0xb8>
    <83b>   DW_AT_data_member_location: 64
 <2><83c>: Abbrev Number: 29 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x1d37): description
    <841>   DW_AT_decl_file   : 15
    <842>   DW_AT_decl_line   : 962
    <844>   DW_AT_decl_column : 9
    <845>   DW_AT_type        : <0xb8>
    <849>   DW_AT_data_member_location: 72
 <2><84a>: Abbrev Number: 29 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x220): next
    <84f>   DW_AT_decl_file   : 15
    <850>   DW_AT_decl_line   : 964
    <852>   DW_AT_decl_column : 11
    <853>   DW_AT_type        : <0x89f>
    <857>   DW_AT_data_member_location: 80
 <2><858>: Abbrev Number: 29 (DW_TAG_member)
    <859>   DW_AT_name        : (indirect string, offset: 0x1eb1): prev
    <85d>   DW_AT_decl_file   : 15
    <85e>   DW_AT_decl_line   : 965
    <860>   DW_AT_decl_column : 11
    <861>   DW_AT_type        : <0x89f>
    <865>   DW_AT_data_member_location: 88
 <2><866>: Abbrev Number: 29 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0x16d8): hashNext
    <86b>   DW_AT_decl_file   : 15
    <86c>   DW_AT_decl_line   : 966
    <86e>   DW_AT_decl_column : 11
    <86f>   DW_AT_type        : <0x89f>
    <873>   DW_AT_data_member_location: 96
 <2><874>: Abbrev Number: 29 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x14ad): hashPrev
    <879>   DW_AT_decl_file   : 15
    <87a>   DW_AT_decl_line   : 967
    <87c>   DW_AT_decl_column : 11
    <87d>   DW_AT_type        : <0x89f>
    <881>   DW_AT_data_member_location: 104
 <2><882>: Abbrev Number: 29 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0x1185): hashIndex
    <887>   DW_AT_decl_file   : 15
    <888>   DW_AT_decl_line   : 968
    <88a>   DW_AT_decl_column : 8
    <88b>   DW_AT_type        : <0x6f>
    <88f>   DW_AT_data_member_location: 112
 <2><890>: Abbrev Number: 29 (DW_TAG_member)
    <891>   DW_AT_name        : (indirect string, offset: 0x18c8): group
    <895>   DW_AT_decl_file   : 15
    <896>   DW_AT_decl_line   : 969
    <898>   DW_AT_decl_column : 14
    <899>   DW_AT_type        : <0x76c>
    <89d>   DW_AT_data_member_location: 116
 <2><89e>: Abbrev Number: 0
 <1><89f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <8a0>   DW_AT_byte_size   : 8
    <8a1>   DW_AT_type        : <0x779>
 <1><8a5>: Abbrev Number: 6 (DW_TAG_array_type)
    <8a6>   DW_AT_type        : <0xbe>
    <8aa>   DW_AT_sibling     : <0x8b5>
 <2><8ae>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <8af>   DW_AT_type        : <0x42>
    <8b3>   DW_AT_upper_bound : 255
 <2><8b4>: Abbrev Number: 0
 <1><8b5>: Abbrev Number: 30 (DW_TAG_structure_type)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x138d): playerState_s
    <8ba>   DW_AT_byte_size   : 468
    <8bc>   DW_AT_decl_file   : 15
    <8bd>   DW_AT_decl_line   : 1152
    <8bf>   DW_AT_decl_column : 16
    <8c0>   DW_AT_sibling     : <0xb44>
 <2><8c4>: Abbrev Number: 29 (DW_TAG_member)
    <8c5>   DW_AT_name        : (indirect string, offset: 0x9f): commandTime
    <8c9>   DW_AT_decl_file   : 15
    <8ca>   DW_AT_decl_line   : 1153
    <8cc>   DW_AT_decl_column : 8
    <8cd>   DW_AT_type        : <0x6f>
    <8d1>   DW_AT_data_member_location: 0
 <2><8d2>: Abbrev Number: 29 (DW_TAG_member)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x10b1): pm_type
    <8d7>   DW_AT_decl_file   : 15
    <8d8>   DW_AT_decl_line   : 1154
    <8da>   DW_AT_decl_column : 8
    <8db>   DW_AT_type        : <0x6f>
    <8df>   DW_AT_data_member_location: 4
 <2><8e0>: Abbrev Number: 29 (DW_TAG_member)
    <8e1>   DW_AT_name        : (indirect string, offset: 0xbfc): bobCycle
    <8e5>   DW_AT_decl_file   : 15
    <8e6>   DW_AT_decl_line   : 1155
    <8e8>   DW_AT_decl_column : 8
    <8e9>   DW_AT_type        : <0x6f>
    <8ed>   DW_AT_data_member_location: 8
 <2><8ee>: Abbrev Number: 29 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x17e3): pm_flags
    <8f3>   DW_AT_decl_file   : 15
    <8f4>   DW_AT_decl_line   : 1156
    <8f6>   DW_AT_decl_column : 8
    <8f7>   DW_AT_type        : <0x6f>
    <8fb>   DW_AT_data_member_location: 12
 <2><8fc>: Abbrev Number: 29 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x1d0b): pm_time
    <901>   DW_AT_decl_file   : 15
    <902>   DW_AT_decl_line   : 1157
    <904>   DW_AT_decl_column : 8
    <905>   DW_AT_type        : <0x6f>
    <909>   DW_AT_data_member_location: 16
 <2><90a>: Abbrev Number: 29 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0x1d52): origin
    <90f>   DW_AT_decl_file   : 15
    <910>   DW_AT_decl_line   : 1159
    <912>   DW_AT_decl_column : 10
    <913>   DW_AT_type        : <0x4bd>
    <917>   DW_AT_data_member_location: 20
 <2><918>: Abbrev Number: 29 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0x1497): velocity
    <91d>   DW_AT_decl_file   : 15
    <91e>   DW_AT_decl_line   : 1160
    <920>   DW_AT_decl_column : 10
    <921>   DW_AT_type        : <0x4bd>
    <925>   DW_AT_data_member_location: 32
 <2><926>: Abbrev Number: 29 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0x1efa): weaponTime
    <92b>   DW_AT_decl_file   : 15
    <92c>   DW_AT_decl_line   : 1161
    <92e>   DW_AT_decl_column : 8
    <92f>   DW_AT_type        : <0x6f>
    <933>   DW_AT_data_member_location: 44
 <2><934>: Abbrev Number: 29 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0x323): gravity
    <939>   DW_AT_decl_file   : 15
    <93a>   DW_AT_decl_line   : 1162
    <93c>   DW_AT_decl_column : 8
    <93d>   DW_AT_type        : <0x6f>
    <941>   DW_AT_data_member_location: 48
 <2><942>: Abbrev Number: 29 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x18b7): speed
    <947>   DW_AT_decl_file   : 15
    <948>   DW_AT_decl_line   : 1163
    <94a>   DW_AT_decl_column : 8
    <94b>   DW_AT_type        : <0x6f>
    <94f>   DW_AT_data_member_location: 52
 <2><950>: Abbrev Number: 29 (DW_TAG_member)
    <951>   DW_AT_name        : (indirect string, offset: 0xbbf): delta_angles
    <955>   DW_AT_decl_file   : 15
    <956>   DW_AT_decl_line   : 1164
    <958>   DW_AT_decl_column : 8
    <959>   DW_AT_type        : <0xb44>
    <95d>   DW_AT_data_member_location: 56
 <2><95e>: Abbrev Number: 29 (DW_TAG_member)
    <95f>   DW_AT_name        : (indirect string, offset: 0x1570): groundEntityNum
    <963>   DW_AT_decl_file   : 15
    <964>   DW_AT_decl_line   : 1167
    <966>   DW_AT_decl_column : 8
    <967>   DW_AT_type        : <0x6f>
    <96b>   DW_AT_data_member_location: 68
 <2><96c>: Abbrev Number: 29 (DW_TAG_member)
    <96d>   DW_AT_name        : (indirect string, offset: 0x4d1): legsTimer
    <971>   DW_AT_decl_file   : 15
    <972>   DW_AT_decl_line   : 1169
    <974>   DW_AT_decl_column : 8
    <975>   DW_AT_type        : <0x6f>
    <979>   DW_AT_data_member_location: 72
 <2><97a>: Abbrev Number: 29 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x9ac): legsAnim
    <97f>   DW_AT_decl_file   : 15
    <980>   DW_AT_decl_line   : 1170
    <982>   DW_AT_decl_column : 8
    <983>   DW_AT_type        : <0x6f>
    <987>   DW_AT_data_member_location: 76
 <2><988>: Abbrev Number: 29 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x144): torsoTimer
    <98d>   DW_AT_decl_file   : 15
    <98e>   DW_AT_decl_line   : 1172
    <990>   DW_AT_decl_column : 8
    <991>   DW_AT_type        : <0x6f>
    <995>   DW_AT_data_member_location: 80
 <2><996>: Abbrev Number: 29 (DW_TAG_member)
    <997>   DW_AT_name        : (indirect string, offset: 0x1d59): torsoAnim
    <99b>   DW_AT_decl_file   : 15
    <99c>   DW_AT_decl_line   : 1173
    <99e>   DW_AT_decl_column : 8
    <99f>   DW_AT_type        : <0x6f>
    <9a3>   DW_AT_data_member_location: 84
 <2><9a4>: Abbrev Number: 29 (DW_TAG_member)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x1c21): movementDir
    <9a9>   DW_AT_decl_file   : 15
    <9aa>   DW_AT_decl_line   : 1175
    <9ac>   DW_AT_decl_column : 8
    <9ad>   DW_AT_type        : <0x6f>
    <9b1>   DW_AT_data_member_location: 88
 <2><9b2>: Abbrev Number: 29 (DW_TAG_member)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x954): grapplePoint
    <9b7>   DW_AT_decl_file   : 15
    <9b8>   DW_AT_decl_line   : 1180
    <9ba>   DW_AT_decl_column : 10
    <9bb>   DW_AT_type        : <0x4bd>
    <9bf>   DW_AT_data_member_location: 92
 <2><9c0>: Abbrev Number: 29 (DW_TAG_member)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x1a16): eFlags
    <9c5>   DW_AT_decl_file   : 15
    <9c6>   DW_AT_decl_line   : 1182
    <9c8>   DW_AT_decl_column : 8
    <9c9>   DW_AT_type        : <0x6f>
    <9cd>   DW_AT_data_member_location: 104
 <2><9ce>: Abbrev Number: 29 (DW_TAG_member)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x4fd): eventSequence
    <9d3>   DW_AT_decl_file   : 15
    <9d4>   DW_AT_decl_line   : 1184
    <9d6>   DW_AT_decl_column : 8
    <9d7>   DW_AT_type        : <0x6f>
    <9db>   DW_AT_data_member_location: 108
 <2><9dc>: Abbrev Number: 29 (DW_TAG_member)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x1e07): events
    <9e1>   DW_AT_decl_file   : 15
    <9e2>   DW_AT_decl_line   : 1185
    <9e4>   DW_AT_decl_column : 8
    <9e5>   DW_AT_type        : <0xa6>
    <9e9>   DW_AT_data_member_location: 112
 <2><9ea>: Abbrev Number: 29 (DW_TAG_member)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x1ba1): eventParms
    <9ef>   DW_AT_decl_file   : 15
    <9f0>   DW_AT_decl_line   : 1186
    <9f2>   DW_AT_decl_column : 8
    <9f3>   DW_AT_type        : <0xa6>
    <9f7>   DW_AT_data_member_location: 120
 <2><9f8>: Abbrev Number: 29 (DW_TAG_member)
    <9f9>   DW_AT_name        : (indirect string, offset: 0x2d3): externalEvent
    <9fd>   DW_AT_decl_file   : 15
    <9fe>   DW_AT_decl_line   : 1188
    <a00>   DW_AT_decl_column : 8
    <a01>   DW_AT_type        : <0x6f>
    <a05>   DW_AT_data_member_location: 128
 <2><a06>: Abbrev Number: 29 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0x20e): externalEventParm
    <a0b>   DW_AT_decl_file   : 15
    <a0c>   DW_AT_decl_line   : 1189
    <a0e>   DW_AT_decl_column : 8
    <a0f>   DW_AT_type        : <0x6f>
    <a13>   DW_AT_data_member_location: 132
 <2><a14>: Abbrev Number: 29 (DW_TAG_member)
    <a15>   DW_AT_name        : (indirect string, offset: 0x15ab): externalEventTime
    <a19>   DW_AT_decl_file   : 15
    <a1a>   DW_AT_decl_line   : 1190
    <a1c>   DW_AT_decl_column : 8
    <a1d>   DW_AT_type        : <0x6f>
    <a21>   DW_AT_data_member_location: 136
 <2><a22>: Abbrev Number: 29 (DW_TAG_member)
    <a23>   DW_AT_name        : (indirect string, offset: 0x916): clientNum
    <a27>   DW_AT_decl_file   : 15
    <a28>   DW_AT_decl_line   : 1192
    <a2a>   DW_AT_decl_column : 8
    <a2b>   DW_AT_type        : <0x6f>
    <a2f>   DW_AT_data_member_location: 140
 <2><a30>: Abbrev Number: 29 (DW_TAG_member)
    <a31>   DW_AT_name        : (indirect string, offset: 0x178b): weapon
    <a35>   DW_AT_decl_file   : 15
    <a36>   DW_AT_decl_line   : 1193
    <a38>   DW_AT_decl_column : 8
    <a39>   DW_AT_type        : <0x6f>
    <a3d>   DW_AT_data_member_location: 144
 <2><a3e>: Abbrev Number: 29 (DW_TAG_member)
    <a3f>   DW_AT_name        : (indirect string, offset: 0x138): weaponstate
    <a43>   DW_AT_decl_file   : 15
    <a44>   DW_AT_decl_line   : 1194
    <a46>   DW_AT_decl_column : 8
    <a47>   DW_AT_type        : <0x6f>
    <a4b>   DW_AT_data_member_location: 148
 <2><a4c>: Abbrev Number: 29 (DW_TAG_member)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x134a): viewangles
    <a51>   DW_AT_decl_file   : 15
    <a52>   DW_AT_decl_line   : 1196
    <a54>   DW_AT_decl_column : 10
    <a55>   DW_AT_type        : <0x4bd>
    <a59>   DW_AT_data_member_location: 152
 <2><a5a>: Abbrev Number: 29 (DW_TAG_member)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x351): viewheight
    <a5f>   DW_AT_decl_file   : 15
    <a60>   DW_AT_decl_line   : 1197
    <a62>   DW_AT_decl_column : 8
    <a63>   DW_AT_type        : <0x6f>
    <a67>   DW_AT_data_member_location: 164
 <2><a68>: Abbrev Number: 29 (DW_TAG_member)
    <a69>   DW_AT_name        : (indirect string, offset: 0x338): damageEvent
    <a6d>   DW_AT_decl_file   : 15
    <a6e>   DW_AT_decl_line   : 1200
    <a70>   DW_AT_decl_column : 8
    <a71>   DW_AT_type        : <0x6f>
    <a75>   DW_AT_data_member_location: 168
 <2><a76>: Abbrev Number: 29 (DW_TAG_member)
    <a77>   DW_AT_name        : (indirect string, offset: 0x1eda): damageYaw
    <a7b>   DW_AT_decl_file   : 15
    <a7c>   DW_AT_decl_line   : 1201
    <a7e>   DW_AT_decl_column : 8
    <a7f>   DW_AT_type        : <0x6f>
    <a83>   DW_AT_data_member_location: 172
 <2><a84>: Abbrev Number: 29 (DW_TAG_member)
    <a85>   DW_AT_name        : (indirect string, offset: 0x10fe): damagePitch
    <a89>   DW_AT_decl_file   : 15
    <a8a>   DW_AT_decl_line   : 1202
    <a8c>   DW_AT_decl_column : 8
    <a8d>   DW_AT_type        : <0x6f>
    <a91>   DW_AT_data_member_location: 176
 <2><a92>: Abbrev Number: 29 (DW_TAG_member)
    <a93>   DW_AT_name        : (indirect string, offset: 0x1451): damageCount
    <a97>   DW_AT_decl_file   : 15
    <a98>   DW_AT_decl_line   : 1203
    <a9a>   DW_AT_decl_column : 8
    <a9b>   DW_AT_type        : <0x6f>
    <a9f>   DW_AT_data_member_location: 180
 <2><aa0>: Abbrev Number: 29 (DW_TAG_member)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x11ea): stats
    <aa5>   DW_AT_decl_file   : 15
    <aa6>   DW_AT_decl_line   : 1205
    <aa8>   DW_AT_decl_column : 8
    <aa9>   DW_AT_type        : <0xb54>
    <aad>   DW_AT_data_member_location: 184
 <2><aae>: Abbrev Number: 29 (DW_TAG_member)
    <aaf>   DW_AT_name        : (indirect string, offset: 0xffd): persistant
    <ab3>   DW_AT_decl_file   : 15
    <ab4>   DW_AT_decl_line   : 1206
    <ab6>   DW_AT_decl_column : 8
    <ab7>   DW_AT_type        : <0xb54>
    <abb>   DW_AT_data_member_location: 248
 <2><abc>: Abbrev Number: 31 (DW_TAG_member)
    <abd>   DW_AT_name        : (indirect string, offset: 0x1f71): powerups
    <ac1>   DW_AT_decl_file   : 15
    <ac2>   DW_AT_decl_line   : 1207
    <ac4>   DW_AT_decl_column : 8
    <ac5>   DW_AT_type        : <0xb54>
    <ac9>   DW_AT_data_member_location: 312
 <2><acb>: Abbrev Number: 31 (DW_TAG_member)
    <acc>   DW_AT_name        : (indirect string, offset: 0xbba): ammo
    <ad0>   DW_AT_decl_file   : 15
    <ad1>   DW_AT_decl_line   : 1208
    <ad3>   DW_AT_decl_column : 8
    <ad4>   DW_AT_type        : <0xb54>
    <ad8>   DW_AT_data_member_location: 376
 <2><ada>: Abbrev Number: 31 (DW_TAG_member)
    <adb>   DW_AT_name        : (indirect string, offset: 0x14b6): generic1
    <adf>   DW_AT_decl_file   : 15
    <ae0>   DW_AT_decl_line   : 1210
    <ae2>   DW_AT_decl_column : 8
    <ae3>   DW_AT_type        : <0x6f>
    <ae7>   DW_AT_data_member_location: 440
 <2><ae9>: Abbrev Number: 31 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x1dd): loopSound
    <aee>   DW_AT_decl_file   : 15
    <aef>   DW_AT_decl_line   : 1211
    <af1>   DW_AT_decl_column : 8
    <af2>   DW_AT_type        : <0x6f>
    <af6>   DW_AT_data_member_location: 444
 <2><af8>: Abbrev Number: 31 (DW_TAG_member)
    <af9>   DW_AT_name        : (indirect string, offset: 0x4a2): jumppad_ent
    <afd>   DW_AT_decl_file   : 15
    <afe>   DW_AT_decl_line   : 1212
    <b00>   DW_AT_decl_column : 8
    <b01>   DW_AT_type        : <0x6f>
    <b05>   DW_AT_data_member_location: 448
 <2><b07>: Abbrev Number: 31 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x7a5): ping
    <b0c>   DW_AT_decl_file   : 15
    <b0d>   DW_AT_decl_line   : 1215
    <b0f>   DW_AT_decl_column : 8
    <b10>   DW_AT_type        : <0x6f>
    <b14>   DW_AT_data_member_location: 452
 <2><b16>: Abbrev Number: 31 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0xf2): pmove_framecount
    <b1b>   DW_AT_decl_file   : 15
    <b1c>   DW_AT_decl_line   : 1216
    <b1e>   DW_AT_decl_column : 8
    <b1f>   DW_AT_type        : <0x6f>
    <b23>   DW_AT_data_member_location: 456
 <2><b25>: Abbrev Number: 31 (DW_TAG_member)
    <b26>   DW_AT_name        : (indirect string, offset: 0xf44): jumppad_frame
    <b2a>   DW_AT_decl_file   : 15
    <b2b>   DW_AT_decl_line   : 1217
    <b2d>   DW_AT_decl_column : 8
    <b2e>   DW_AT_type        : <0x6f>
    <b32>   DW_AT_data_member_location: 460
 <2><b34>: Abbrev Number: 31 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0x15ed): entityEventSequence
    <b39>   DW_AT_decl_file   : 15
    <b3a>   DW_AT_decl_line   : 1218
    <b3c>   DW_AT_decl_column : 8
    <b3d>   DW_AT_type        : <0x6f>
    <b41>   DW_AT_data_member_location: 464
 <2><b43>: Abbrev Number: 0
 <1><b44>: Abbrev Number: 6 (DW_TAG_array_type)
    <b45>   DW_AT_type        : <0x6f>
    <b49>   DW_AT_sibling     : <0xb54>
 <2><b4d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <b4e>   DW_AT_type        : <0x42>
    <b52>   DW_AT_upper_bound : 2
 <2><b53>: Abbrev Number: 0
 <1><b54>: Abbrev Number: 6 (DW_TAG_array_type)
    <b55>   DW_AT_type        : <0x6f>
    <b59>   DW_AT_sibling     : <0xb64>
 <2><b5d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <b5e>   DW_AT_type        : <0x42>
    <b62>   DW_AT_upper_bound : 15
 <2><b63>: Abbrev Number: 0
 <1><b64>: Abbrev Number: 22 (DW_TAG_typedef)
    <b65>   DW_AT_name        : (indirect string, offset: 0x139b): playerState_t
    <b69>   DW_AT_decl_file   : 15
    <b6a>   DW_AT_decl_line   : 1219
    <b6c>   DW_AT_decl_column : 3
    <b6d>   DW_AT_type        : <0x8b5>
 <1><b71>: Abbrev Number: 28 (DW_TAG_structure_type)
    <b72>   DW_AT_name        : (indirect string, offset: 0x520): usercmd_s
    <b76>   DW_AT_byte_size   : 24
    <b77>   DW_AT_decl_file   : 15
    <b78>   DW_AT_decl_line   : 1252
    <b7a>   DW_AT_decl_column : 16
    <b7b>   DW_AT_sibling     : <0xbe2>
 <2><b7f>: Abbrev Number: 29 (DW_TAG_member)
    <b80>   DW_AT_name        : (indirect string, offset: 0xefa): serverTime
    <b84>   DW_AT_decl_file   : 15
    <b85>   DW_AT_decl_line   : 1253
    <b87>   DW_AT_decl_column : 9
    <b88>   DW_AT_type        : <0x6f>
    <b8c>   DW_AT_data_member_location: 0
 <2><b8d>: Abbrev Number: 29 (DW_TAG_member)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x4e4): angles
    <b92>   DW_AT_decl_file   : 15
    <b93>   DW_AT_decl_line   : 1254
    <b95>   DW_AT_decl_column : 9
    <b96>   DW_AT_type        : <0xb44>
    <b9a>   DW_AT_data_member_location: 4
 <2><b9b>: Abbrev Number: 29 (DW_TAG_member)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x1c19): buttons
    <ba0>   DW_AT_decl_file   : 15
    <ba1>   DW_AT_decl_line   : 1255
    <ba3>   DW_AT_decl_column : 9
    <ba4>   DW_AT_type        : <0x6f>
    <ba8>   DW_AT_data_member_location: 16
 <2><ba9>: Abbrev Number: 29 (DW_TAG_member)
    <baa>   DW_AT_name        : (indirect string, offset: 0x178b): weapon
    <bae>   DW_AT_decl_file   : 15
    <baf>   DW_AT_decl_line   : 1256
    <bb1>   DW_AT_decl_column : 9
    <bb2>   DW_AT_type        : <0x457>
    <bb6>   DW_AT_data_member_location: 20
 <2><bb7>: Abbrev Number: 29 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x13bb): forwardmove
    <bbc>   DW_AT_decl_file   : 15
    <bbd>   DW_AT_decl_line   : 1257
    <bbf>   DW_AT_decl_column : 14
    <bc0>   DW_AT_type        : <0x49>
    <bc4>   DW_AT_data_member_location: 21
 <2><bc5>: Abbrev Number: 29 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x1093): rightmove
    <bca>   DW_AT_decl_file   : 15
    <bcb>   DW_AT_decl_line   : 1257
    <bcd>   DW_AT_decl_column : 27
    <bce>   DW_AT_type        : <0x49>
    <bd2>   DW_AT_data_member_location: 22
 <2><bd3>: Abbrev Number: 29 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x71): upmove
    <bd8>   DW_AT_decl_file   : 15
    <bd9>   DW_AT_decl_line   : 1257
    <bdb>   DW_AT_decl_column : 38
    <bdc>   DW_AT_type        : <0x49>
    <be0>   DW_AT_data_member_location: 23
 <2><be1>: Abbrev Number: 0
 <1><be2>: Abbrev Number: 22 (DW_TAG_typedef)
    <be3>   DW_AT_name        : (indirect string, offset: 0x52a): usercmd_t
    <be7>   DW_AT_decl_file   : 15
    <be8>   DW_AT_decl_line   : 1258
    <bea>   DW_AT_decl_column : 3
    <beb>   DW_AT_type        : <0xb71>
 <1><bef>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <bf0>   DW_AT_encoding    : 7	(unsigned)
    <bf1>   DW_AT_byte_size   : 4
    <bf2>   DW_AT_type        : <0x3b>
    <bf6>   DW_AT_decl_file   : 15
    <bf7>   DW_AT_decl_line   : 1265
    <bf9>   DW_AT_decl_column : 14
    <bfa>   DW_AT_sibling     : <0xc23>
 <2><bfe>: Abbrev Number: 21 (DW_TAG_enumerator)
    <bff>   DW_AT_name        : (indirect string, offset: 0x2e1): TR_STATIONARY
    <c03>   DW_AT_const_value : 0
 <2><c04>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c05>   DW_AT_name        : (indirect string, offset: 0x1024): TR_INTERPOLATE
    <c09>   DW_AT_const_value : 1
 <2><c0a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c0b>   DW_AT_name        : (indirect string, offset: 0xcd): TR_LINEAR
    <c0f>   DW_AT_const_value : 2
 <2><c10>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c11>   DW_AT_name        : (indirect string, offset: 0x1aee): TR_LINEAR_STOP
    <c15>   DW_AT_const_value : 3
 <2><c16>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c17>   DW_AT_name        : (indirect string, offset: 0xe1d): TR_SINE
    <c1b>   DW_AT_const_value : 4
 <2><c1c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <c1d>   DW_AT_name        : (indirect string, offset: 0x4ae): TR_GRAVITY
    <c21>   DW_AT_const_value : 5
 <2><c22>: Abbrev Number: 0
 <1><c23>: Abbrev Number: 22 (DW_TAG_typedef)
    <c24>   DW_AT_name        : (indirect string, offset: 0x946): trType_t
    <c28>   DW_AT_decl_file   : 15
    <c29>   DW_AT_decl_line   : 1272
    <c2b>   DW_AT_decl_column : 3
    <c2c>   DW_AT_type        : <0xbef>
 <1><c30>: Abbrev Number: 32 (DW_TAG_structure_type)
    <c31>   DW_AT_byte_size   : 36
    <c32>   DW_AT_decl_file   : 15
    <c33>   DW_AT_decl_line   : 1274
    <c35>   DW_AT_decl_column : 9
    <c36>   DW_AT_sibling     : <0xc81>
 <2><c3a>: Abbrev Number: 29 (DW_TAG_member)
    <c3b>   DW_AT_name        : (indirect string, offset: 0xd7): trType
    <c3f>   DW_AT_decl_file   : 15
    <c40>   DW_AT_decl_line   : 1275
    <c42>   DW_AT_decl_column : 11
    <c43>   DW_AT_type        : <0xc23>
    <c47>   DW_AT_data_member_location: 0
 <2><c48>: Abbrev Number: 29 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0xd59): trTime
    <c4d>   DW_AT_decl_file   : 15
    <c4e>   DW_AT_decl_line   : 1276
    <c50>   DW_AT_decl_column : 7
    <c51>   DW_AT_type        : <0x6f>
    <c55>   DW_AT_data_member_location: 4
 <2><c56>: Abbrev Number: 29 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0xb20): trDuration
    <c5b>   DW_AT_decl_file   : 15
    <c5c>   DW_AT_decl_line   : 1277
    <c5e>   DW_AT_decl_column : 7
    <c5f>   DW_AT_type        : <0x6f>
    <c63>   DW_AT_data_member_location: 8
 <2><c64>: Abbrev Number: 29 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x2a7): trBase
    <c69>   DW_AT_decl_file   : 15
    <c6a>   DW_AT_decl_line   : 1278
    <c6c>   DW_AT_decl_column : 9
    <c6d>   DW_AT_type        : <0x4bd>
    <c71>   DW_AT_data_member_location: 12
 <2><c72>: Abbrev Number: 29 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0x8bb): trDelta
    <c77>   DW_AT_decl_file   : 15
    <c78>   DW_AT_decl_line   : 1279
    <c7a>   DW_AT_decl_column : 9
    <c7b>   DW_AT_type        : <0x4bd>
    <c7f>   DW_AT_data_member_location: 24
 <2><c80>: Abbrev Number: 0
 <1><c81>: Abbrev Number: 22 (DW_TAG_typedef)
    <c82>   DW_AT_name        : (indirect string, offset: 0xe5e): trajectory_t
    <c86>   DW_AT_decl_file   : 15
    <c87>   DW_AT_decl_line   : 1280
    <c89>   DW_AT_decl_column : 3
    <c8a>   DW_AT_type        : <0xc30>
 <1><c8e>: Abbrev Number: 28 (DW_TAG_structure_type)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x1040): entityState_s
    <c93>   DW_AT_byte_size   : 208
    <c94>   DW_AT_decl_file   : 15
    <c95>   DW_AT_decl_line   : 1289
    <c97>   DW_AT_decl_column : 16
    <c98>   DW_AT_sibling     : <0xe25>
 <2><c9c>: Abbrev Number: 29 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x803): number
    <ca1>   DW_AT_decl_file   : 15
    <ca2>   DW_AT_decl_line   : 1290
    <ca4>   DW_AT_decl_column : 7
    <ca5>   DW_AT_type        : <0x6f>
    <ca9>   DW_AT_data_member_location: 0
 <2><caa>: Abbrev Number: 29 (DW_TAG_member)
    <cab>   DW_AT_name        : (indirect string, offset: 0x11e4): eType
    <caf>   DW_AT_decl_file   : 15
    <cb0>   DW_AT_decl_line   : 1291
    <cb2>   DW_AT_decl_column : 7
    <cb3>   DW_AT_type        : <0x6f>
    <cb7>   DW_AT_data_member_location: 4
 <2><cb8>: Abbrev Number: 29 (DW_TAG_member)
    <cb9>   DW_AT_name        : (indirect string, offset: 0x1a16): eFlags
    <cbd>   DW_AT_decl_file   : 15
    <cbe>   DW_AT_decl_line   : 1292
    <cc0>   DW_AT_decl_column : 7
    <cc1>   DW_AT_type        : <0x6f>
    <cc5>   DW_AT_data_member_location: 8
 <2><cc6>: Abbrev Number: 33 (DW_TAG_member)
    <cc7>   DW_AT_name        : pos
    <ccb>   DW_AT_decl_file   : 15
    <ccc>   DW_AT_decl_line   : 1294
    <cce>   DW_AT_decl_column : 15
    <ccf>   DW_AT_type        : <0xc81>
    <cd3>   DW_AT_data_member_location: 12
 <2><cd4>: Abbrev Number: 29 (DW_TAG_member)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x16d3): apos
    <cd9>   DW_AT_decl_file   : 15
    <cda>   DW_AT_decl_line   : 1295
    <cdc>   DW_AT_decl_column : 15
    <cdd>   DW_AT_type        : <0xc81>
    <ce1>   DW_AT_data_member_location: 48
 <2><ce2>: Abbrev Number: 29 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x12d1): time
    <ce7>   DW_AT_decl_file   : 15
    <ce8>   DW_AT_decl_line   : 1297
    <cea>   DW_AT_decl_column : 7
    <ceb>   DW_AT_type        : <0x6f>
    <cef>   DW_AT_data_member_location: 84
 <2><cf0>: Abbrev Number: 29 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0xebe): time2
    <cf5>   DW_AT_decl_file   : 15
    <cf6>   DW_AT_decl_line   : 1298
    <cf8>   DW_AT_decl_column : 7
    <cf9>   DW_AT_type        : <0x6f>
    <cfd>   DW_AT_data_member_location: 88
 <2><cfe>: Abbrev Number: 29 (DW_TAG_member)
    <cff>   DW_AT_name        : (indirect string, offset: 0x1d52): origin
    <d03>   DW_AT_decl_file   : 15
    <d04>   DW_AT_decl_line   : 1300
    <d06>   DW_AT_decl_column : 9
    <d07>   DW_AT_type        : <0x4bd>
    <d0b>   DW_AT_data_member_location: 92
 <2><d0c>: Abbrev Number: 29 (DW_TAG_member)
    <d0d>   DW_AT_name        : (indirect string, offset: 0xba6): origin2
    <d11>   DW_AT_decl_file   : 15
    <d12>   DW_AT_decl_line   : 1301
    <d14>   DW_AT_decl_column : 9
    <d15>   DW_AT_type        : <0x4bd>
    <d19>   DW_AT_data_member_location: 104
 <2><d1a>: Abbrev Number: 29 (DW_TAG_member)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x4e4): angles
    <d1f>   DW_AT_decl_file   : 15
    <d20>   DW_AT_decl_line   : 1303
    <d22>   DW_AT_decl_column : 9
    <d23>   DW_AT_type        : <0x4bd>
    <d27>   DW_AT_data_member_location: 116
 <2><d28>: Abbrev Number: 29 (DW_TAG_member)
    <d29>   DW_AT_name        : (indirect string, offset: 0x22d): angles2
    <d2d>   DW_AT_decl_file   : 15
    <d2e>   DW_AT_decl_line   : 1304
    <d30>   DW_AT_decl_column : 9
    <d31>   DW_AT_type        : <0x4bd>
    <d35>   DW_AT_data_member_location: 128
 <2><d36>: Abbrev Number: 29 (DW_TAG_member)
    <d37>   DW_AT_name        : (indirect string, offset: 0x1e38): otherEntityNum
    <d3b>   DW_AT_decl_file   : 15
    <d3c>   DW_AT_decl_line   : 1306
    <d3e>   DW_AT_decl_column : 7
    <d3f>   DW_AT_type        : <0x6f>
    <d43>   DW_AT_data_member_location: 140
 <2><d44>: Abbrev Number: 29 (DW_TAG_member)
    <d45>   DW_AT_name        : (indirect string, offset: 0xe6b): otherEntityNum2
    <d49>   DW_AT_decl_file   : 15
    <d4a>   DW_AT_decl_line   : 1307
    <d4c>   DW_AT_decl_column : 7
    <d4d>   DW_AT_type        : <0x6f>
    <d51>   DW_AT_data_member_location: 144
 <2><d52>: Abbrev Number: 29 (DW_TAG_member)
    <d53>   DW_AT_name        : (indirect string, offset: 0x1570): groundEntityNum
    <d57>   DW_AT_decl_file   : 15
    <d58>   DW_AT_decl_line   : 1309
    <d5a>   DW_AT_decl_column : 7
    <d5b>   DW_AT_type        : <0x6f>
    <d5f>   DW_AT_data_member_location: 148
 <2><d60>: Abbrev Number: 29 (DW_TAG_member)
    <d61>   DW_AT_name        : (indirect string, offset: 0x191a): constantLight
    <d65>   DW_AT_decl_file   : 15
    <d66>   DW_AT_decl_line   : 1311
    <d68>   DW_AT_decl_column : 7
    <d69>   DW_AT_type        : <0x6f>
    <d6d>   DW_AT_data_member_location: 152
 <2><d6e>: Abbrev Number: 29 (DW_TAG_member)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x1dd): loopSound
    <d73>   DW_AT_decl_file   : 15
    <d74>   DW_AT_decl_line   : 1312
    <d76>   DW_AT_decl_column : 7
    <d77>   DW_AT_type        : <0x6f>
    <d7b>   DW_AT_data_member_location: 156
 <2><d7c>: Abbrev Number: 29 (DW_TAG_member)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x1c2d): modelindex
    <d81>   DW_AT_decl_file   : 15
    <d82>   DW_AT_decl_line   : 1314
    <d84>   DW_AT_decl_column : 7
    <d85>   DW_AT_type        : <0x6f>
    <d89>   DW_AT_data_member_location: 160
 <2><d8a>: Abbrev Number: 29 (DW_TAG_member)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x16fe): modelindex2
    <d8f>   DW_AT_decl_file   : 15
    <d90>   DW_AT_decl_line   : 1315
    <d92>   DW_AT_decl_column : 7
    <d93>   DW_AT_type        : <0x6f>
    <d97>   DW_AT_data_member_location: 164
 <2><d98>: Abbrev Number: 29 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0x916): clientNum
    <d9d>   DW_AT_decl_file   : 15
    <d9e>   DW_AT_decl_line   : 1316
    <da0>   DW_AT_decl_column : 7
    <da1>   DW_AT_type        : <0x6f>
    <da5>   DW_AT_data_member_location: 168
 <2><da6>: Abbrev Number: 29 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x1ec5): frame
    <dab>   DW_AT_decl_file   : 15
    <dac>   DW_AT_decl_line   : 1317
    <dae>   DW_AT_decl_column : 7
    <daf>   DW_AT_type        : <0x6f>
    <db3>   DW_AT_data_member_location: 172
 <2><db4>: Abbrev Number: 29 (DW_TAG_member)
    <db5>   DW_AT_name        : (indirect string, offset: 0x103): solid
    <db9>   DW_AT_decl_file   : 15
    <dba>   DW_AT_decl_line   : 1319
    <dbc>   DW_AT_decl_column : 7
    <dbd>   DW_AT_type        : <0x6f>
    <dc1>   DW_AT_data_member_location: 176
 <2><dc2>: Abbrev Number: 29 (DW_TAG_member)
    <dc3>   DW_AT_name        : (indirect string, offset: 0x6): event
    <dc7>   DW_AT_decl_file   : 15
    <dc8>   DW_AT_decl_line   : 1321
    <dca>   DW_AT_decl_column : 7
    <dcb>   DW_AT_type        : <0x6f>
    <dcf>   DW_AT_data_member_location: 180
 <2><dd0>: Abbrev Number: 29 (DW_TAG_member)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x534): eventParm
    <dd5>   DW_AT_decl_file   : 15
    <dd6>   DW_AT_decl_line   : 1322
    <dd8>   DW_AT_decl_column : 7
    <dd9>   DW_AT_type        : <0x6f>
    <ddd>   DW_AT_data_member_location: 184
 <2><dde>: Abbrev Number: 29 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x1f71): powerups
    <de3>   DW_AT_decl_file   : 15
    <de4>   DW_AT_decl_line   : 1325
    <de6>   DW_AT_decl_column : 7
    <de7>   DW_AT_type        : <0x6f>
    <deb>   DW_AT_data_member_location: 188
 <2><dec>: Abbrev Number: 29 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0x178b): weapon
    <df1>   DW_AT_decl_file   : 15
    <df2>   DW_AT_decl_line   : 1326
    <df4>   DW_AT_decl_column : 7
    <df5>   DW_AT_type        : <0x6f>
    <df9>   DW_AT_data_member_location: 192
 <2><dfa>: Abbrev Number: 29 (DW_TAG_member)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x9ac): legsAnim
    <dff>   DW_AT_decl_file   : 15
    <e00>   DW_AT_decl_line   : 1327
    <e02>   DW_AT_decl_column : 7
    <e03>   DW_AT_type        : <0x6f>
    <e07>   DW_AT_data_member_location: 196
 <2><e08>: Abbrev Number: 29 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0x1d59): torsoAnim
    <e0d>   DW_AT_decl_file   : 15
    <e0e>   DW_AT_decl_line   : 1328
    <e10>   DW_AT_decl_column : 7
    <e11>   DW_AT_type        : <0x6f>
    <e15>   DW_AT_data_member_location: 200
 <2><e16>: Abbrev Number: 29 (DW_TAG_member)
    <e17>   DW_AT_name        : (indirect string, offset: 0x14b6): generic1
    <e1b>   DW_AT_decl_file   : 15
    <e1c>   DW_AT_decl_line   : 1330
    <e1e>   DW_AT_decl_column : 7
    <e1f>   DW_AT_type        : <0x6f>
    <e23>   DW_AT_data_member_location: 204
 <2><e24>: Abbrev Number: 0
 <1><e25>: Abbrev Number: 22 (DW_TAG_typedef)
    <e26>   DW_AT_name        : (indirect string, offset: 0x104e): entityState_t
    <e2a>   DW_AT_decl_file   : 15
    <e2b>   DW_AT_decl_line   : 1331
    <e2d>   DW_AT_decl_column : 3
    <e2e>   DW_AT_type        : <0xc8e>
 <1><e32>: Abbrev Number: 6 (DW_TAG_array_type)
    <e33>   DW_AT_type        : <0xbe>
    <e37>   DW_AT_sibling     : <0xe42>
 <2><e3b>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e3c>   DW_AT_type        : <0x42>
    <e40>   DW_AT_upper_bound : 63
 <2><e41>: Abbrev Number: 0
 <1><e42>: Abbrev Number: 34 (DW_TAG_structure_type)
    <e43>   DW_AT_byte_size   : 48
    <e44>   DW_AT_decl_file   : 16
    <e45>   DW_AT_decl_line   : 61
    <e46>   DW_AT_decl_column : 9
    <e47>   DW_AT_sibling     : <0xec1>
 <2><e4b>: Abbrev Number: 15 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x7f5): allowoverflow
    <e50>   DW_AT_decl_file   : 16
    <e51>   DW_AT_decl_line   : 62
    <e52>   DW_AT_decl_column : 11
    <e53>   DW_AT_type        : <0x483>
    <e57>   DW_AT_data_member_location: 0
 <2><e58>: Abbrev Number: 15 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0xcab): overflowed
    <e5d>   DW_AT_decl_file   : 16
    <e5e>   DW_AT_decl_line   : 63
    <e5f>   DW_AT_decl_column : 11
    <e60>   DW_AT_type        : <0x483>
    <e64>   DW_AT_data_member_location: 4
 <2><e65>: Abbrev Number: 35 (DW_TAG_member)
    <e66>   DW_AT_name        : oob
    <e6a>   DW_AT_decl_file   : 16
    <e6b>   DW_AT_decl_line   : 64
    <e6c>   DW_AT_decl_column : 11
    <e6d>   DW_AT_type        : <0x483>
    <e71>   DW_AT_data_member_location: 8
 <2><e72>: Abbrev Number: 15 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x18f2): data
    <e77>   DW_AT_decl_file   : 16
    <e78>   DW_AT_decl_line   : 65
    <e79>   DW_AT_decl_column : 8
    <e7a>   DW_AT_type        : <0xec1>
    <e7e>   DW_AT_data_member_location: 16
 <2><e7f>: Abbrev Number: 15 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x80a): maxsize
    <e84>   DW_AT_decl_file   : 16
    <e85>   DW_AT_decl_line   : 66
    <e86>   DW_AT_decl_column : 7
    <e87>   DW_AT_type        : <0x6f>
    <e8b>   DW_AT_data_member_location: 24
 <2><e8c>: Abbrev Number: 15 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x1f14): maxbits
    <e91>   DW_AT_decl_file   : 16
    <e92>   DW_AT_decl_line   : 67
    <e93>   DW_AT_decl_column : 7
    <e94>   DW_AT_type        : <0x6f>
    <e98>   DW_AT_data_member_location: 28
 <2><e99>: Abbrev Number: 15 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x12e9): cursize
    <e9e>   DW_AT_decl_file   : 16
    <e9f>   DW_AT_decl_line   : 68
    <ea0>   DW_AT_decl_column : 7
    <ea1>   DW_AT_type        : <0x6f>
    <ea5>   DW_AT_data_member_location: 32
 <2><ea6>: Abbrev Number: 15 (DW_TAG_member)
    <ea7>   DW_AT_name        : (indirect string, offset: 0xd4f): readcount
    <eab>   DW_AT_decl_file   : 16
    <eac>   DW_AT_decl_line   : 69
    <ead>   DW_AT_decl_column : 7
    <eae>   DW_AT_type        : <0x6f>
    <eb2>   DW_AT_data_member_location: 36
 <2><eb3>: Abbrev Number: 35 (DW_TAG_member)
    <eb4>   DW_AT_name        : bit
    <eb8>   DW_AT_decl_file   : 16
    <eb9>   DW_AT_decl_line   : 70
    <eba>   DW_AT_decl_column : 7
    <ebb>   DW_AT_type        : <0x6f>
    <ebf>   DW_AT_data_member_location: 40
 <2><ec0>: Abbrev Number: 0
 <1><ec1>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ec2>   DW_AT_byte_size   : 8
    <ec3>   DW_AT_type        : <0x457>
 <1><ec7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x43): msg_t
    <ecc>   DW_AT_decl_file   : 16
    <ecd>   DW_AT_decl_line   : 71
    <ece>   DW_AT_decl_column : 3
    <ecf>   DW_AT_type        : <0xe42>
 <1><ed3>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <ed4>   DW_AT_encoding    : 7	(unsigned)
    <ed5>   DW_AT_byte_size   : 4
    <ed6>   DW_AT_type        : <0x3b>
    <eda>   DW_AT_decl_file   : 16
    <edb>   DW_AT_decl_line   : 159
    <edc>   DW_AT_decl_column : 14
    <edd>   DW_AT_sibling     : <0xf12>
 <2><ee1>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x5a5): NA_BAD
    <ee6>   DW_AT_const_value : 0
 <2><ee7>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ee8>   DW_AT_name        : (indirect string, offset: 0xd10): NA_BOT
    <eec>   DW_AT_const_value : 1
 <2><eed>: Abbrev Number: 21 (DW_TAG_enumerator)
    <eee>   DW_AT_name        : (indirect string, offset: 0x1cc1): NA_LOOPBACK
    <ef2>   DW_AT_const_value : 2
 <2><ef3>: Abbrev Number: 21 (DW_TAG_enumerator)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xc05): NA_BROADCAST
    <ef8>   DW_AT_const_value : 3
 <2><ef9>: Abbrev Number: 21 (DW_TAG_enumerator)
    <efa>   DW_AT_name        : (indirect string, offset: 0x116): NA_IP
    <efe>   DW_AT_const_value : 4
 <2><eff>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f00>   DW_AT_name        : (indirect string, offset: 0x3ef): NA_IP6
    <f04>   DW_AT_const_value : 5
 <2><f05>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f06>   DW_AT_name        : (indirect string, offset: 0xc12): NA_MULTICAST6
    <f0a>   DW_AT_const_value : 6
 <2><f0b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x11c): NA_UNSPEC
    <f10>   DW_AT_const_value : 7
 <2><f11>: Abbrev Number: 0
 <1><f12>: Abbrev Number: 3 (DW_TAG_typedef)
    <f13>   DW_AT_name        : (indirect string, offset: 0x11c5): netadrtype_t
    <f17>   DW_AT_decl_file   : 16
    <f18>   DW_AT_decl_line   : 170
    <f19>   DW_AT_decl_column : 3
    <f1a>   DW_AT_type        : <0xed3>
 <1><f1e>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <f1f>   DW_AT_encoding    : 7	(unsigned)
    <f20>   DW_AT_byte_size   : 4
    <f21>   DW_AT_type        : <0x3b>
    <f25>   DW_AT_decl_file   : 16
    <f26>   DW_AT_decl_line   : 173
    <f27>   DW_AT_decl_column : 14
    <f28>   DW_AT_sibling     : <0xf39>
 <2><f2c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x12c0): NS_CLIENT
    <f31>   DW_AT_const_value : 0
 <2><f32>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f33>   DW_AT_name        : (indirect string, offset: 0x5b4): NS_SERVER
    <f37>   DW_AT_const_value : 1
 <2><f38>: Abbrev Number: 0
 <1><f39>: Abbrev Number: 3 (DW_TAG_typedef)
    <f3a>   DW_AT_name        : (indirect string, offset: 0xa4e): netsrc_t
    <f3e>   DW_AT_decl_file   : 16
    <f3f>   DW_AT_decl_line   : 176
    <f40>   DW_AT_decl_column : 3
    <f41>   DW_AT_type        : <0xf1e>
 <1><f45>: Abbrev Number: 36 (DW_TAG_union_type)
    <f46>   DW_AT_byte_size   : 16
    <f47>   DW_AT_decl_file   : 16
    <f48>   DW_AT_decl_line   : 183
    <f49>   DW_AT_decl_column : 2
    <f4a>   DW_AT_sibling     : <0xf65>
 <2><f4e>: Abbrev Number: 37 (DW_TAG_member)
    <f4f>   DW_AT_name        : _4
    <f52>   DW_AT_decl_file   : 16
    <f53>   DW_AT_decl_line   : 184
    <f54>   DW_AT_decl_column : 8
    <f55>   DW_AT_type        : <0x48f>
 <2><f59>: Abbrev Number: 37 (DW_TAG_member)
    <f5a>   DW_AT_name        : _6
    <f5d>   DW_AT_decl_file   : 16
    <f5e>   DW_AT_decl_line   : 186
    <f5f>   DW_AT_decl_column : 8
    <f60>   DW_AT_type        : <0xf65>
 <2><f64>: Abbrev Number: 0
 <1><f65>: Abbrev Number: 6 (DW_TAG_array_type)
    <f66>   DW_AT_type        : <0x457>
    <f6a>   DW_AT_sibling     : <0xf75>
 <2><f6e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <f6f>   DW_AT_type        : <0x42>
    <f73>   DW_AT_upper_bound : 15
 <2><f74>: Abbrev Number: 0
 <1><f75>: Abbrev Number: 34 (DW_TAG_structure_type)
    <f76>   DW_AT_byte_size   : 32
    <f77>   DW_AT_decl_file   : 16
    <f78>   DW_AT_decl_line   : 181
    <f79>   DW_AT_decl_column : 9
    <f7a>   DW_AT_sibling     : <0xfb3>
 <2><f7e>: Abbrev Number: 15 (DW_TAG_member)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x5c3): type
    <f83>   DW_AT_decl_file   : 16
    <f84>   DW_AT_decl_line   : 182
    <f85>   DW_AT_decl_column : 15
    <f86>   DW_AT_type        : <0xf12>
    <f8a>   DW_AT_data_member_location: 0
 <2><f8b>: Abbrev Number: 35 (DW_TAG_member)
    <f8c>   DW_AT_name        : ipv
    <f90>   DW_AT_decl_file   : 16
    <f91>   DW_AT_decl_line   : 188
    <f92>   DW_AT_decl_column : 4
    <f93>   DW_AT_type        : <0xf45>
    <f97>   DW_AT_data_member_location: 4
 <2><f98>: Abbrev Number: 15 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0x1c52): port
    <f9d>   DW_AT_decl_file   : 16
    <f9e>   DW_AT_decl_line   : 189
    <f9f>   DW_AT_decl_column : 11
    <fa0>   DW_AT_type        : <0x433>
    <fa4>   DW_AT_data_member_location: 20
 <2><fa5>: Abbrev Number: 15 (DW_TAG_member)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x733): scope_id
    <faa>   DW_AT_decl_file   : 16
    <fab>   DW_AT_decl_line   : 191
    <fac>   DW_AT_decl_column : 16
    <fad>   DW_AT_type        : <0x42>
    <fb1>   DW_AT_data_member_location: 24
 <2><fb2>: Abbrev Number: 0
 <1><fb3>: Abbrev Number: 3 (DW_TAG_typedef)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xc7a): netadr_t
    <fb8>   DW_AT_decl_file   : 16
    <fb9>   DW_AT_decl_line   : 193
    <fba>   DW_AT_decl_column : 3
    <fbb>   DW_AT_type        : <0xf75>
 <1><fbf>: Abbrev Number: 5 (DW_TAG_const_type)
    <fc0>   DW_AT_type        : <0xfb3>
 <1><fc4>: Abbrev Number: 38 (DW_TAG_structure_type)
    <fc5>   DW_AT_byte_size   : 32864
    <fc7>   DW_AT_decl_file   : 16
    <fc8>   DW_AT_decl_line   : 234
    <fc9>   DW_AT_decl_column : 9
    <fca>   DW_AT_sibling     : <0x10c8>
 <2><fce>: Abbrev Number: 15 (DW_TAG_member)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x10f9): sock
    <fd3>   DW_AT_decl_file   : 16
    <fd4>   DW_AT_decl_line   : 235
    <fd5>   DW_AT_decl_column : 11
    <fd6>   DW_AT_type        : <0xf39>
    <fda>   DW_AT_data_member_location: 0
 <2><fdb>: Abbrev Number: 15 (DW_TAG_member)
    <fdc>   DW_AT_name        : (indirect string, offset: 0xb18): dropped
    <fe0>   DW_AT_decl_file   : 16
    <fe1>   DW_AT_decl_line   : 237
    <fe2>   DW_AT_decl_column : 8
    <fe3>   DW_AT_type        : <0x6f>
    <fe7>   DW_AT_data_member_location: 4
 <2><fe8>: Abbrev Number: 15 (DW_TAG_member)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x835): remoteAddress
    <fed>   DW_AT_decl_file   : 16
    <fee>   DW_AT_decl_line   : 239
    <fef>   DW_AT_decl_column : 11
    <ff0>   DW_AT_type        : <0xfb3>
    <ff4>   DW_AT_data_member_location: 8
 <2><ff5>: Abbrev Number: 15 (DW_TAG_member)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x1840): qport
    <ffa>   DW_AT_decl_file   : 16
    <ffb>   DW_AT_decl_line   : 240
    <ffc>   DW_AT_decl_column : 8
    <ffd>   DW_AT_type        : <0x6f>
    <1001>   DW_AT_data_member_location: 40
 <2><1002>: Abbrev Number: 15 (DW_TAG_member)
    <1003>   DW_AT_name        : (indirect string, offset: 0x8da): incomingSequence
    <1007>   DW_AT_decl_file   : 16
    <1008>   DW_AT_decl_line   : 243
    <1009>   DW_AT_decl_column : 8
    <100a>   DW_AT_type        : <0x6f>
    <100e>   DW_AT_data_member_location: 44
 <2><100f>: Abbrev Number: 15 (DW_TAG_member)
    <1010>   DW_AT_name        : (indirect string, offset: 0x1064): outgoingSequence
    <1014>   DW_AT_decl_file   : 16
    <1015>   DW_AT_decl_line   : 244
    <1016>   DW_AT_decl_column : 8
    <1017>   DW_AT_type        : <0x6f>
    <101b>   DW_AT_data_member_location: 48
 <2><101c>: Abbrev Number: 15 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0xda9): fragmentSequence
    <1021>   DW_AT_decl_file   : 16
    <1022>   DW_AT_decl_line   : 247
    <1023>   DW_AT_decl_column : 8
    <1024>   DW_AT_type        : <0x6f>
    <1028>   DW_AT_data_member_location: 52
 <2><1029>: Abbrev Number: 15 (DW_TAG_member)
    <102a>   DW_AT_name        : (indirect string, offset: 0x1f1c): fragmentLength
    <102e>   DW_AT_decl_file   : 16
    <102f>   DW_AT_decl_line   : 248
    <1030>   DW_AT_decl_column : 8
    <1031>   DW_AT_type        : <0x6f>
    <1035>   DW_AT_data_member_location: 56
 <2><1036>: Abbrev Number: 15 (DW_TAG_member)
    <1037>   DW_AT_name        : (indirect string, offset: 0x13fa): fragmentBuffer
    <103b>   DW_AT_decl_file   : 16
    <103c>   DW_AT_decl_line   : 249
    <103d>   DW_AT_decl_column : 8
    <103e>   DW_AT_type        : <0x10c8>
    <1042>   DW_AT_data_member_location: 60
 <2><1043>: Abbrev Number: 39 (DW_TAG_member)
    <1044>   DW_AT_name        : (indirect string, offset: 0x8a2): unsentFragments
    <1048>   DW_AT_decl_file   : 16
    <1049>   DW_AT_decl_line   : 253
    <104a>   DW_AT_decl_column : 11
    <104b>   DW_AT_type        : <0x483>
    <104f>   DW_AT_data_member_location: 16444
 <2><1051>: Abbrev Number: 39 (DW_TAG_member)
    <1052>   DW_AT_name        : (indirect string, offset: 0x15d9): unsentFragmentStart
    <1056>   DW_AT_decl_file   : 16
    <1057>   DW_AT_decl_line   : 254
    <1058>   DW_AT_decl_column : 8
    <1059>   DW_AT_type        : <0x6f>
    <105d>   DW_AT_data_member_location: 16448
 <2><105f>: Abbrev Number: 39 (DW_TAG_member)
    <1060>   DW_AT_name        : (indirect string, offset: 0x1dfa): unsentLength
    <1064>   DW_AT_decl_file   : 16
    <1065>   DW_AT_decl_line   : 255
    <1066>   DW_AT_decl_column : 8
    <1067>   DW_AT_type        : <0x6f>
    <106b>   DW_AT_data_member_location: 16452
 <2><106d>: Abbrev Number: 31 (DW_TAG_member)
    <106e>   DW_AT_name        : (indirect string, offset: 0x12dc): unsentBuffer
    <1072>   DW_AT_decl_file   : 16
    <1073>   DW_AT_decl_line   : 256
    <1075>   DW_AT_decl_column : 8
    <1076>   DW_AT_type        : <0x10c8>
    <107a>   DW_AT_data_member_location: 16456
 <2><107c>: Abbrev Number: 31 (DW_TAG_member)
    <107d>   DW_AT_name        : (indirect string, offset: 0x1b2c): challenge
    <1081>   DW_AT_decl_file   : 16
    <1082>   DW_AT_decl_line   : 258
    <1084>   DW_AT_decl_column : 8
    <1085>   DW_AT_type        : <0x6f>
    <1089>   DW_AT_data_member_location: 32840
 <2><108b>: Abbrev Number: 31 (DW_TAG_member)
    <108c>   DW_AT_name        : (indirect string, offset: 0x1e8b): lastSentTime
    <1090>   DW_AT_decl_file   : 16
    <1091>   DW_AT_decl_line   : 259
    <1093>   DW_AT_decl_column : 8
    <1094>   DW_AT_type        : <0x6f>
    <1098>   DW_AT_data_member_location: 32844
 <2><109a>: Abbrev Number: 31 (DW_TAG_member)
    <109b>   DW_AT_name        : (indirect string, offset: 0x1667): lastSentSize
    <109f>   DW_AT_decl_file   : 16
    <10a0>   DW_AT_decl_line   : 260
    <10a2>   DW_AT_decl_column : 8
    <10a3>   DW_AT_type        : <0x6f>
    <10a7>   DW_AT_data_member_location: 32848
 <2><10a9>: Abbrev Number: 31 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x365): compat
    <10ae>   DW_AT_decl_file   : 16
    <10af>   DW_AT_decl_line   : 262
    <10b1>   DW_AT_decl_column : 11
    <10b2>   DW_AT_type        : <0x483>
    <10b6>   DW_AT_data_member_location: 32852
 <2><10b8>: Abbrev Number: 31 (DW_TAG_member)
    <10b9>   DW_AT_name        : (indirect string, offset: 0x1717): isLANAddress
    <10bd>   DW_AT_decl_file   : 16
    <10be>   DW_AT_decl_line   : 263
    <10c0>   DW_AT_decl_column : 11
    <10c1>   DW_AT_type        : <0x483>
    <10c5>   DW_AT_data_member_location: 32856
 <2><10c7>: Abbrev Number: 0
 <1><10c8>: Abbrev Number: 6 (DW_TAG_array_type)
    <10c9>   DW_AT_type        : <0x457>
    <10cd>   DW_AT_sibling     : <0x10d9>
 <2><10d1>: Abbrev Number: 24 (DW_TAG_subrange_type)
    <10d2>   DW_AT_type        : <0x42>
    <10d6>   DW_AT_upper_bound : 16383
 <2><10d8>: Abbrev Number: 0
 <1><10d9>: Abbrev Number: 22 (DW_TAG_typedef)
    <10da>   DW_AT_name        : (indirect string, offset: 0x19b7): netchan_t
    <10de>   DW_AT_decl_file   : 16
    <10df>   DW_AT_decl_line   : 265
    <10e1>   DW_AT_decl_column : 3
    <10e2>   DW_AT_type        : <0xfc4>
 <1><10e6>: Abbrev Number: 6 (DW_TAG_array_type)
    <10e7>   DW_AT_type        : <0x76>
    <10eb>   DW_AT_sibling     : <0x10f1>
 <2><10ef>: Abbrev Number: 19 (DW_TAG_subrange_type)
 <2><10f0>: Abbrev Number: 0
 <1><10f1>: Abbrev Number: 5 (DW_TAG_const_type)
    <10f2>   DW_AT_type        : <0x10e6>
 <1><10f6>: Abbrev Number: 10 (DW_TAG_variable)
    <10f7>   DW_AT_name        : (indirect string, offset: 0x1877): demo_protocols
    <10fb>   DW_AT_decl_file   : 16
    <10fc>   DW_AT_decl_line   : 292
    <10fe>   DW_AT_decl_column : 18
    <10ff>   DW_AT_type        : <0x10f1>
    <1103>   DW_AT_external    : 1
    <1103>   DW_AT_declaration : 1
 <1><1103>: Abbrev Number: 22 (DW_TAG_typedef)
    <1104>   DW_AT_name        : (indirect string, offset: 0x1729): vm_t
    <1108>   DW_AT_decl_file   : 16
    <1109>   DW_AT_decl_line   : 358
    <110b>   DW_AT_decl_column : 21
    <110c>   DW_AT_type        : <0x1110>
 <1><1110>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1111>   DW_AT_name        : (indirect string, offset: 0x1724): vm_s
    <1115>   DW_AT_byte_size   : 200
    <1116>   DW_AT_decl_file   : 17
    <1117>   DW_AT_decl_line   : 172
    <1118>   DW_AT_decl_column : 8
    <1119>   DW_AT_sibling     : <0x12be>
 <2><111d>: Abbrev Number: 15 (DW_TAG_member)
    <111e>   DW_AT_name        : (indirect string, offset: 0xcbe): systemCall
